{"children":[{"href":"t1en.html","children":[{"href":"t11en.html","children":[{"href":"t111en.html","id":"111","name":"1.11","content":"The world is determined by the facts, and by these\nbegin <i>all</i> the facts."},{"href":"t112en.html","id":"112","name":"1.12","content":"For the totality of facts determines both what is\nthe case, and also all that is not the case."},{"href":"t113en.html","id":"113","name":"1.13","content":"The facts in logical space are the world."}],"id":"11","name":"1.1","content":"The world is the totality of facts, not of things."},{"href":"t12en.html","children":[{"href":"t121en.html","id":"121","name":"1.21","content":"Any one can either be the case or not be the case,\nand everything else remain the same."}],"id":"12","name":"1.2","content":"The world divides into facts."}],"id":"1","name":"1","content":"The world is everything that is the case.\n<a href=\"f1en.html\"><sup>*</sup></a>"},{"href":"t2en.html","children":[{"href":"t201en.html","children":[{"href":"t2011en.html","id":"2011","name":"2.011","content":"It is essential to a thing that it can be a\nconstituent part of an atomic fact."},{"href":"t2012en.html","children":[{"href":"t20121en.html","id":"20121","name":"2.0121","content":"It would, so to speak, appear as an accident,\nwhen to a thing that could exist alone on its own account,\nsubsequently a state of affairs could be made to fit.\nIf things can occur in atomic facts, this possibility\nmust already lie in them.\n(A logical entity cannot be merely possible.  Logic\ntreats of every possibility, and all possibilities are its\nfacts.)\nJust as we cannot think of spatial objects at all apart\nfrom space, or temporal objects apart from time, so we cannot\nthink of <i>any</i> object apart from the possibility of its\nconnexion with other things.\nIf I can think of an object in the context of an atomic\nfact, I cannot think of it apart from the <i>possibility</i> of\nthis context."},{"href":"t20122en.html","id":"20122","name":"2.0122","content":"The thing is independent, in so far as it can\noccur in all <i>possible</i> circumstances, but this form of\nindependence is a form of connexion with the atomic fact, a\nform of dependence.  (It is impossible for words to occur in\ntwo different ways, alone and in the proposition.)"},{"href":"t20123en.html","children":[{"href":"t201231en.html","id":"201231","name":"2.01231","content":"In order to know an object, I must know not its\nexternal but all its internal qualities."}],"id":"20123","name":"2.0123","content":"If I know an object, then I also know all the\npossibilities of its occurrence in atomic facts.\n(Every such possibility must lie in the nature of the\nobject.)\nA new possibility cannot subsequently be found."},{"href":"t20124en.html","id":"20124","name":"2.0124","content":"If all objects are given, then thereby are all\n<i>possible</i> atomic facts also given."}],"id":"2012","name":"2.012","content":"In logic nothing is accidental: if a thing <i>can</i>\noccur in an atomic fact the possibility of that atomic fact\nmust already be prejudged in the thing."},{"href":"t2013en.html","children":[{"href":"t20131en.html","id":"20131","name":"2.0131","content":"A spatial object must lie in infinite space.  (A\npoint in space is an argument place.)\nA speck in a visual field need not be red, but it must\nhave a colour; it has, so to speak, a colour space round it.  A\ntone must have <i>a</i> pitch, the object of the sense of touch\n<i>a</i> hardness, etc."}],"id":"2013","name":"2.013","content":"Every thing is, as it were, in a space of possible\natomic facts.  I can think of this space as empty, but not of\nthe thing without the space."},{"href":"t2014en.html","children":[{"href":"t20141en.html","id":"20141","name":"2.0141","content":"The possibility of its occurrence in atomic facts\nis the form of the object."}],"id":"2014","name":"2.014","content":"Objects contain the possibility of all states of\naffairs."},{"href":"t215en.html","children":[{"href":"t2151en.html","children":[{"href":"t21511en.html","id":"21511","name":"2.1511","content":"Thus the picture is linked with reality; it\nreaches up to it."},{"href":"t21512en.html","children":[{"href":"t215121en.html","id":"215121","name":"2.15121","content":"Only the outermost points of the dividing lines\n<i>touch</i> the object to be measured."}],"id":"21512","name":"2.1512","content":"It is like a scale applied to reality."},{"href":"t21513en.html","id":"21513","name":"2.1513","content":"According to this view the representing relation\nwhich makes it a picture, also belongs to the picture."},{"href":"t21514en.html","id":"21514","name":"2.1514","content":"The representing releation consists of the\nco-ordinations of the elements of the picture and the things."},{"href":"t21515en.html","id":"21515","name":"2.1515","content":"These co-ordinations are as it were the feelers\nof its elements with which the picture touches reality."}],"id":"2151","name":"2.151","content":"The form of representation is the pissibility that\nthe things are combined with one another as are the elements of\nthe picture."}],"id":"215","name":"2.15","content":"That the elements of the picture are combined with\none another in a definite way, represents that the things are\nso combined with one another.\nThis connexion of the elements of the picture is called\nits structure, and the possibility of this structure is called\nthe form of representation of the picture."},{"href":"t216en.html","children":[{"href":"t2161en.html","id":"2161","name":"2.161","content":"In the picture and the pictured there must be a\nsomething identical in order that the one can be a picture of\nthe other at all."}],"id":"216","name":"2.16","content":"In order to be a picture a fact must have something\nin common with what it pictures."},{"href":"t217en.html","children":[{"href":"t2171en.html","id":"2171","name":"2.171","content":"The picture can represent every reality whose form\nit has.\nThe spatial picture, everything spatial, the coloured,\neverything coloured, etc."},{"href":"t2172en.html","id":"2172","name":"2.172","content":"The picture, however, cannot represent its form of\nrepresentation; it shows it forth."},{"href":"t2173en.html","id":"2173","name":"2.173","content":"The picture represents its object from without\n(its standpoint is its form of representation), therefore the\npicture represents its object rightly or falsely."},{"href":"t2174en.html","id":"2174","name":"2.174","content":"But the picture cannot place itself outside of its\nform of representation."}],"id":"217","name":"2.17","content":"What the picture must have in common with reality\nin order to be able to represent it after is manner -- rightly\nor falsely -- is its form of representation."},{"href":"t218en.html","children":[{"href":"t2181en.html","id":"2181","name":"2.181","content":"If the form of representation is the logical form,\nthen the picture is called a logical picture."},{"href":"t2182en.html","id":"2182","name":"2.182","content":"Every picture is <i>also</i> a logical picture.  (On\nthe other hand, for example, not every picture is spatial.)"}],"id":"218","name":"2.18","content":"What every picture, of whatever form, must have in\ncommon with reality in order to be able to represent it at all\n-- rightly or falsely -- is the logical form, that is, the form\nof reality."},{"href":"t219en.html","id":"219","name":"2.19","content":"The logical picture can depict the world."}],"id":"201","name":"2.01","content":"An atomic fact is a combination of objects\n(entities, things)."},{"href":"t202en.html","children":[{"href":"t20201en.html","children":[{"href":"t20211en.html","id":"20211","name":"2.0211","content":"If the world had no substance, then whether a\nproposition had sense would depend on whether another\nproposition was true."},{"href":"t20212en.html","id":"20212","name":"2.0212","content":"It would then be impossible to form a picture of\nthe world (true or false)."}],"id":"20201","name":"2.0201","content":"Every statement about complexes can be analysed\ninto a statement about their constituent parts, and into those\npropositions which completely describe the complexes."},{"href":"t2022en.html","children":[{"href":"t2221en.html","id":"2221","name":"2.221","content":"What the picture represents is its sense."},{"href":"t2222en.html","id":"2222","name":"2.222","content":"In the agreement or disagreement of its sense with\nreality, its truth or falsity consists."},{"href":"t2223en.html","id":"2223","name":"2.223","content":"In order to discover whether the picture is true\nor false we must compare it with reality."},{"href":"t2224en.html","id":"2224","name":"2.224","content":"It cannot be discovered from the picture alone\nwhether it is true or false."},{"href":"t2225en.html","id":"2225","name":"2.225","content":"There is no picture which is a priori true."}],"id":"2022","name":"2.022","content":"It is clear that however different from the real\none an imagined world may be, it must have something -- a form\n-- in common with the real world."},{"href":"t2023en.html","children":[{"href":"t20231en.html","id":"20231","name":"2.0231","content":"The substance of the world <i>can</i> only determine\na form and not any material properties.  For these are first\npresented by the propositions -- first formed by the\nconfiguration of the objects."},{"href":"t20232en.html","id":"20232","name":"2.0232","content":"Roughly speaking: objects are colourless."},{"href":"t20233en.html","children":[{"href":"t202331en.html","id":"202331","name":"2.02331","content":"Either a thing has properties which no other\nhas, and then one can distinguish it straght away from the\nothers by a description and refer to it; or, on the other hand,\nthere are several things which have the totality of their\nproperties in common, and then it is quite impossible to point\nto any one of them.\nFor it a thing is not distinguished by anything, I\ncannot distinguish it -- for otherwise it would be\ndistinguished."}],"id":"20233","name":"2.0233","content":"Two objects of the same logical form are -- apart\nfrom their external properties -- only differentiated from one\nanother in that they are different."}],"id":"2023","name":"2.023","content":"This fixed form consists of the objects."},{"href":"t2024en.html","id":"2024","name":"2.024","content":"Substance is what exists independently of what is\nthe case."},{"href":"t2025en.html","children":[{"href":"t20251en.html","id":"20251","name":"2.0251","content":"Space, time and colour (colouredness) are forms\nof obejcts."}],"id":"2025","name":"2.025","content":"It is form and content."},{"href":"t2026en.html","id":"2026","name":"2.026","content":"Only if there are objects can there be a fixed\nform of the world."},{"href":"t2027en.html","children":[{"href":"t20271en.html","id":"20271","name":"2.0271","content":"The object is the fixed, the existent; the\nconfiguration is the changing, the variable."},{"href":"t20272en.html","id":"20272","name":"2.0272","content":"The configuration of the objects forms the atomic\nfact."}],"id":"2027","name":"2.027","content":"The fixed, the existent and the object are one."}],"id":"202","name":"2.02","content":"The object is simple."},{"href":"t203en.html","children":[{"href":"t2031en.html","id":"2031","name":"2.031","content":"In the atomic fact the objects are combined in a\ndefinite way."},{"href":"t2032en.html","id":"2032","name":"2.032","content":"The way in which objects hang together in the\natomic fact is the structure of the atomic fact."},{"href":"t2033en.html","id":"2033","name":"2.033","content":"The form is the possibility of the structure."},{"href":"t2034en.html","id":"2034","name":"2.034","content":"The structure of the fact consists of the\nstructures of the atomic facts."}],"id":"203","name":"2.03","content":"In the atomic fact objects hang one in another,\nlike the links of a chain."},{"href":"t204en.html","id":"204","name":"2.04","content":"The totality of existent atomic facts is the world."},{"href":"t205en.html","id":"205","name":"2.05","content":"The totality of existent atomic facts also\ndetermines which atomic facts do not exist."},{"href":"t206en.html","children":[{"href":"t2061en.html","id":"2061","name":"2.061","content":"Atomic facts are independent of one another."},{"href":"t2062en.html","id":"2062","name":"2.062","content":"From the existence of non-existence of an atomic\nfact we cannot infer the existence of non-existence of another."},{"href":"t2063en.html","id":"2063","name":"2.063","content":"The total reality is the world."}],"id":"206","name":"2.06","content":"The existence and non-existence of atomic facts is\nthe reality.\n(The existence of atomic facts we also call a positive\nfact, their non-existence a negative fact.)"}],"id":"2","name":"2","content":"What is the case, the fact, is the existence of atomic\nfacts."},{"href":"t3en.html","children":[{"href":"t3001en.html","children":[{"href":"t311en.html","id":"311","name":"3.11","content":"We use the sensibly perceptible sign (sound or\nwritten sign, etc.) of the proposition as a projection of the\npossible state of affairs.\nThe method of projection is the thinking of the sense\nof the proposition."},{"href":"t312en.html","id":"312","name":"3.12","content":"The sign through which we express the though I call\nthe proposition sign.  And the proposition is the proposition\nsign in its projective relation to the world."},{"href":"t313en.html","id":"313","name":"3.13","content":"To the proposition belongs everything which belongs\nto the projection; but not what is projected.\nTherefore the possibility of what is projected but not\nthis itself.\nIn the proposition, therefore, its sense is not yet\ncontained, but the possibility of expressing it.\n(\"The content of the proposition\" means the content of\nthe signicant proposition.)\nIn the proposition the form of its sense is contained,\nbut not its content."},{"href":"t314en.html","children":[{"href":"t3141en.html","id":"3141","name":"3.141","content":"The proposition is not a mixture of words (just as\nthe musical theme is not a mixture of tones).\nThe proposition is articulate."},{"href":"t3142en.html","id":"3142","name":"3.142","content":"Only facts can express a sense, a class of names\ncannot."},{"href":"t3143en.html","children":[{"href":"t31431en.html","id":"31431","name":"3.1431","content":"The essential nature of the propositional sign\nbecomes very clean when we imagine it made up of spatial\nobjects (such as tables, chairs, books) instead of written\nsigns.\nThe mutual spatial position of these things then\nexpresses the sense of the proposition."},{"href":"t31432en.html","id":"31432","name":"3.1432","content":"We must not say, \"The complex sign\n`<i>aRb</i>' says `<i>a</i> stands in relation\n<i>R</i> to <i>b</i>'\"; but we must says,\n\"<i>That</i> `<i>a</i>' stands in a certain\nrelation to `<i>b</i>' says <i>that</i>\n<i>aRb</i>\"."}],"id":"3143","name":"3.143","content":"That the propositional sign is a fact is concealed\nby the ordinary form of expression, written or printed.\n(For in the printed proposition, for example, the sign\nof a proposition does not appear essentially different from a\nword.  Thus it was possible for Frege to call the proposition a\ncompounded name.)"},{"href":"t3144en.html","id":"3144","name":"3.144","content":"States of affairs can be described but not\n<i>named</i>.\n(Names resemble points; propositions resemble arrows,\nthey have senses.)"}],"id":"314","name":"3.14","content":"The propositional sign consists in the fact that\nits elements, the words, are combined in it in a definite way.\nThe propositional sign is a fact."}],"id":"3001","name":"3.001","content":"\"An atomic fact is thinkable\" -- means: we can\nimagine it."},{"href":"t302en.html","children":[{"href":"t3201en.html","id":"3201","name":"3.201","content":"These elements I call \"simple signs\" and the\nproposition \"completely analysed\"."},{"href":"t3202en.html","children":[{"href":"t3221en.html","id":"3221","name":"3.221","content":"Objects I can only <i>name</i>.  Signs represent\nthem.  I can only speak <i>of</i> them.  I cannot <i>assert\nthem</i>.  A proposition can only say <i>how</i>a thing is, not\n<i>what</i> it is."}],"id":"3202","name":"3.202","content":"The simple signs employed in propositions are\ncalled names."},{"href":"t3203en.html","id":"3203","name":"3.203","content":"The name means the object.  The object is its\nmeaning.  (\"<i>A</i>\" is the same sign as \"<i>A</i>\".)"},{"href":"t324en.html","id":"324","name":"3.24","content":"A proposition about a complex stands in internal\nrelation to the proposition about its consituent part.\nA complex can only be given by its description, and\nthis will either be right or wrong.  The propostion in which\nthere is mention of a complex, if this does not exist, becomes\nnot nonsense but simply false.\nThat a propositional element signifies a complex can be\nseen from an indeterminateness in the propositions in which it\noccurs.  We <i>know</i> that everything is not yet determined by\nthis proposition.  (The notation for generality contains a\nprototype.)\nThe combination of the symbols of a complex in a simple\nsymbol can be expressed by a definition."},{"href":"t325en.html","children":[{"href":"t3251en.html","id":"3251","name":"3.251","content":"The proposition expresses what it expresses in a\ndefinite and clearly specifiable way: the proposition is\narticulate."}],"id":"325","name":"3.25","content":"There is one and only one complete analysis of the\nproposition."},{"href":"t326en.html","children":[{"href":"t3261en.html","id":"3261","name":"3.261","content":"Every defined sign signifies <i>via</i> those signs\nby which it is defined, and the definitions show the way.\nTwo signs, one a primitive sign, and one defined by\nprimitive signs, cannot signify in the same way.  Names\n<i>cannot</i> be taken to pieces by definition (nor any sign which\nalone and independently has a meaning)."},{"href":"t3262en.html","id":"3262","name":"3.262","content":"What does not get expressed in the sign is shown\nby its application.  What the signs conceal, their application\ndeclares."},{"href":"t3263en.html","id":"3263","name":"3.263","content":"The meanings of primitive signs can be explained\nby elucidations.  Elucidations are propositions which contain\nthe primitive signs.  They can, therefore, only be under stood\nwhen the meanings of these signs are already known."}],"id":"326","name":"3.26","content":"The name cannot be analysed further by any\ndefinition.  It is a primitive sign."}],"id":"302","name":"3.02","content":"The though contains the possibility of the state of\naffairs which it thinks.\nWhat is thinkable is also possible."},{"href":"t303en.html","children":[{"href":"t3031en.html","children":[{"href":"t3311en.html","id":"3311","name":"3.311","content":"An expression presupposes the forms of all\npropositions in which it can occur.  it is the common\ncharacteristic mark of a class of propositions."},{"href":"t3312en.html","id":"3312","name":"3.312","content":"It is therefore represented by the general form of\nthe propositions which it characterizes.\nAnd in this form the expression is <i>constant</i> and\neverything else <i>variable</i>."},{"href":"t3313en.html","id":"3313","name":"3.313","content":"An expression is thus presented by a variable,\nwhose values are the propositions which contain the expression.\n(In the limiting case the variable becomes constant,\nthe expression a proposition.)\nI call such a variable a \"propositional variable\"."},{"href":"t3314en.html","id":"3314","name":"3.314","content":"An expression has meaning only in a proposition.\nEvery variable can be conceived as a propositional variable.\n(Including the variable name.)"},{"href":"t3315en.html","id":"3315","name":"3.315","content":"If we change a constituent part of a proposition\ninto a variable, there is a class of propositions which are all\nthe values of the resulting variable proposition.  This class\nin general still depends on what, by arbitrary agreement, we\nmean by parts of that proposition.  But if we change all those\nsigns, whose meaning was arbitrarily determined, into\nvariables, there always remains such a class.  But this is now\nno longer dependent on any agreement; it depends only on the\nnature of the proposition.  It corresponds to a logical form,\nto a logical prototype."},{"href":"t3316en.html","id":"3316","name":"3.316","content":"What values the propositional variable can assume\nis determined.\nThe determination of the values <i>is</i> the variable."},{"href":"t3317en.html","id":"3317","name":"3.317","content":"The determination of the values of the\npropositional variable is done by <i>indicating the\npropositions</i> whose common mark the variable is.\nThe determination is a description of these\npropositions.\nThe determination will therefore deal only with symbols\nnot with their meaning.\nAnd <i>only</i> this is essential to the determination,\n<i>that is is only a description of symbols and asserts nothing\nabout whiat is symbolized</i>.\nThe way in which we describe the propositions is not\nessential."},{"href":"t3318en.html","id":"3318","name":"3.318","content":"I conceive the proposition -- like Frege and\nRussell -- as a function of the expressions contained in it."}],"id":"3031","name":"3.031","content":"It used to be said that God could create\neverything, except what was contrary to the laws of logic.  The\ntruth is, we could not <i>say</i> of an \"unlogical\" world how\nit would look."},{"href":"t3032en.html","children":[{"href":"t30321en.html","id":"30321","name":"3.0321","content":"We could present spatially an atomic fact which\ncontradicted the laws of physics, but not one which\ncontradicted the laws of geometry."},{"href":"t3322en.html","id":"3322","name":"3.322","content":"It can never indicate the common characteristic of\ntwo objects that we symbolize them with the same signs but by\ndifferent <i>methods of symbolizing</i>.  For the sign is\narbitrary.  We could therefore equally well choose two\ndifferent signs and where then would be what was common in the\nsymbolization."},{"href":"t3323en.html","id":"3323","name":"3.323","content":"In the language of everyday life it very often\nhappens that the s ame word signifies in two different ways --\nand therefore belongs to two different symbols -- or that two\nwords, which signify in different ways, are apparently applied\nin the same way in the proposition.\nThus the word \"is\" appears as the copula, as the sign\nof equality, and as the expression of existence; \"to exist\" as\nan intransitive verb like \"to go\"; \"identical\" as an\nadjective; we speak of <i>something</i> but also of the fact of\n<i>something</i> happening.\n(In the proposition \"Green is\ngreen\" -- where the first word is a proper name as\nthe last an adjective -- these words have not merely different\nmeanings but they are <i>different symbols</i>.)"},{"href":"t3324en.html","id":"3324","name":"3.324","content":"Thus there easily arise the most fundamental\nconfusions (of which the whole of philosophy is full)."},{"href":"t3325en.html","id":"3325","name":"3.325","content":"In order to avoid these errors, we must employ a\nsymbolism which exlucdes them, by not applying the same sign in\ndifferent symbols and by not applying signs in the same way\nwhich signify in different ways.  A symbolism, that is to say,\nwhich obeys the rules of <i>logical</i> grammar -- of logical\nsyntax.\n(The logical symbolism of Frege and Russell is such a\nlanguage, which, however, does still not exclude all errors.)"},{"href":"t3326en.html","id":"3326","name":"3.326","content":"In order to recognize the symbol in the sign we\nmust consider the significant use."},{"href":"t3327en.html","id":"3327","name":"3.327","content":"The sign determines a logical form only together\nwith its logical syntactic application."},{"href":"t3328en.html","id":"3328","name":"3.328","content":"If a sign is <i>not necessary</i> then it is\nmeaningless.  That is the meaning of Occam's razor.\n(If everything in the symbolism works as though a sign\nhad meaning, then it has meaning.)"}],"id":"3032","name":"3.032","content":"To present in language anything which \"contradicts\nlogic\" is as impossible as in geometry to present by its\nco-ordinates a figure which contradicts the laws of space; or\nto give the co-ordinates of a point which does not exist."},{"href":"t333en.html","children":[{"href":"t3331en.html","id":"3331","name":"3.331","content":"From this observation we get a further view --\ninto Russell's <i>Theory of Types</i>.  Russell's\nerror is shown by the fact that in drawing up his symbolic\nrules he has to speak about the things his signs mean."},{"href":"t3332en.html","id":"3332","name":"3.332","content":"No proposition can say anything about itself,\nbecause the propositional sign cannot be contained in itself\n(that is the \"whole theory of types\")."},{"href":"t3333en.html","id":"3333","name":"3.333","content":"A function cannot be its own argument, because the\nfunctional sign already contains the prototype of its own\nargument and it cannot contain itself.\nIf, for example, we suppose that the function\n<i>F</i>(<i>fx</i>) could be its own argument, then there would be a\nproposition \"<i>F</i>(<i>F</i>(<i>fx</i>))\", and\nin this the outer functions <i>F</i> and the inner function <i>F</i>\nmust have different meanings; for the inner has the form\n<i><img src=\"lcpsi.gif\" alt=\"�psi�\"></i>(<i>fx</i>),\nthe outer the form\n<i><img src=\"lcpsi.gif\" alt=\"�psi�\"></i>(<i><img src=\"lcphi.gif\" alt=\"�phi�\"></i>(<i>fx</i>)).\nCommon to both functions is\nonly the letter \"<i>F</i>\", which by itself\nsignifies nothing.\nThis is at once clear, if instead of\n\"<i>F</i>(<i>F</i>(<i>u</i>))\" we write\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i><img src=\"lcphi.gif\" alt=\"�phi�\"></i>)�:�<i>F</i>(<i><img src=\"lcphi.gif\" alt=\"�phi�\">u</i>)�.�<i><img src=\"lcphi.gif\" alt=\"�phi�\">u</i>=<i>Fu</i>\".\nHerewith Russell's paradox vanishes."},{"href":"t3334en.html","id":"3334","name":"3.334","content":"The rules of logical syntax must follow of\nthemselves, if we only know how every single sign signifies."}],"id":"333","name":"3.33","content":"In logical syntax the meaning of a sign ought never\nto play a r�le; it must admit of being established without\nmention being thereby made of the <i>meaning</i> of a sign; it\nought to presuppose <i>only</i> the description of the\nexpressions."},{"href":"t334en.html","children":[{"href":"t3341en.html","children":[{"href":"t33411en.html","id":"33411","name":"3.3411","content":"One could therefore say the real name is that\nwhich all symbols, which signify an object, have in common.  It\nwould then follow, step by step, that no sort of composition\nwas essential for a name."}],"id":"3341","name":"3.341","content":"The essential in a proposition is therefore that\nwhich is common to all propositions which can express the same\nsense.\nAnd in the same way in general the essential in a\nsymbol is that which all symbols which can fulfil the same\npurpose have in common."},{"href":"t3342en.html","children":[{"href":"t33421en.html","id":"33421","name":"3.3421","content":"A particular method of symbolizing may be\nunimportant, but it is always important that this is a\n<i>possible</i> method of symbolizing.  And this happens as a rule\nin philosophy: The single thing proves over and over again to\nbe unimportant, but the possibility of every single thing\nreveals something about the nature of the world."}],"id":"3342","name":"3.342","content":"In our notations there is indeed something\narbitrary, but <i>this</i> is not arbitrary, namely that <i>if</i> we\nhave determined anything arbitrarily, then something else\n<i>must</i> be the case.  (This results from the <i>essence</i> of\nthe notation.)"},{"href":"t3343en.html","id":"3343","name":"3.343","content":"Definitions are rules for the translation of one\nlanguage into another.  Every correct symbolism must be\ntranslatable into every other according to such rules.  It is\n<i>this</i> which all have in common."},{"href":"t3344en.html","children":[{"href":"t33441en.html","id":"33441","name":"3.3441","content":"We can, for example, express what is common to\nall notations for the truth-functions as follows: It is common\nto them that they all, for example, <i>can be replaced</i> by the\nnotations of \"~<i>p</i>\" (\"not\n<i>p</i>\") and \"<i>p</i> v <i>q</i>\" (\"<i>p</i> or\n<i>q</i>\").\n(Herewith is indicated the way in which a special\npossible notation can give us general information.)"},{"href":"t33442en.html","id":"33442","name":"3.3442","content":"The sign of the complex is not arbitrarily\nresolved in the analysis, in such a way that its resolution\nwould be different in every propositional structure."}],"id":"3344","name":"3.344","content":"What signifies in the symbol is what is common to\nall those symbols by which it can be replaced according to the\nrules of logical syntax."}],"id":"334","name":"3.34","content":"A proposition possesses essential and accidental\nfeatures.\nAccidental are the features which are due to a\nparticular way of producing the propositional sign.  Essential\nare those which alone enable the proposition to express its\nsense."}],"id":"303","name":"3.03","content":"We cannot think anything unlogical, for otherwise\nwe should have to think unlogically."},{"href":"t304en.html","children":[{"href":"t341en.html","children":[{"href":"t3411en.html","id":"3411","name":"3.411","content":"The geometrical and the logical place agree in\nthat each is the possibility of an existence."}],"id":"341","name":"3.41","content":"The propositional sign and the logical\nco-ordinates: that is the logical place."},{"href":"t342en.html","id":"342","name":"3.42","content":"Although a proposition may only determine one place\nin logical space, the whole logical space must already be given\nby it.\n(Otherwise denial, the logical sum, the logical\nproduct, etc., would always introduce new elements -- in\nco-ordination.)\n(The logical scaffolding round the picture determines\nthe logical space.  The proposition reaches through the whole\nlogical space.)"}],"id":"304","name":"3.04","content":"An a priori true thought would be one whose\npossibility guaranteed its truth."},{"href":"t305en.html","id":"305","name":"3.05","content":"Only if we could know a priori that a thought is\ntrue if its truth was to be recognized from the thought itself\n(without an object of comparison)."}],"id":"3","name":"3","content":"The logical picture of the facts is the thought."},{"href":"t4en.html","children":[{"href":"t4001en.html","children":[{"href":"t4011en.html","children":[{"href":"t4111en.html","id":"4111","name":"4.111","content":"Philosophy is not one of the natural sciences.\n(The word \"philosophy\" must mean\nsomething which stands above or below, but not beside the\nnatural sciences.)"},{"href":"t4112en.html","children":[{"href":"t41121en.html","id":"41121","name":"4.1121","content":"Psychology is no nearer related to philosophy,\nthan is any other natural science.\nThe theory of knowledge is the philosophy of\npsychology.\nDoes not my study of sign-language correspond to the\nstudy of thought processes which philosophers held to be so\nessential to the philosophy of logic?  Only they got entangled\nfor the most part in un-essential psychological investigations,\nand there is an analogous danger for my method."},{"href":"t41122en.html","id":"41122","name":"4.1122","content":"The Darwinian theory has no more to do with\nphilosophy than has any other hypothesis of natural science."}],"id":"4112","name":"4.112","content":"The object of philosophy is the logical\nclarification of thoughts.\nPhilosophy is not a theory but an activity.\nA philosophical work consists essentially of\nelucidations.\nThe result of philosophy is not a number of\n\"philosophical propositions\", but to make propositions clear.\nPhilosophy should make clear and delimit sharply the\nthoughts which otherwise are, as it were, opaque and blurred."},{"href":"t4113en.html","id":"4113","name":"4.113","content":"Philosophy limits the disputable sphere of natural\nscience."},{"href":"t4114en.html","id":"4114","name":"4.114","content":"It should limit the thinkable and thereby the\nunthinkable.\nIt should limit the unthinkable from within through the\nthinkable."},{"href":"t4115en.html","id":"4115","name":"4.115","content":"It will mean the unspeakable by clearly displaying\nthe speakable."},{"href":"t4116en.html","id":"4116","name":"4.116","content":"Everything that can be thought at all can be\nthuoght clearly.  Everything that can be said can be said\nclearly."}],"id":"4011","name":"4.011","content":"At the first glancfe the proposition -- say as it\nstands printed on paper -- does not seem to be a picture of the\nreality of which it treats.  But nor does the musical score\nappear at first sight to be a picture of a musical piece; nor\ndoes our phonetic spelling (letters) seem to be a picture of\nour spoken language.  And yet these symbolisms prove to be\npictures -- even in the ordinary sense of the word -- of what\nthey represent."},{"href":"t4012en.html","children":[{"href":"t4121en.html","children":[{"href":"t41211en.html","id":"41211","name":"4.1211","content":"Thus a proposition \"<i>fa</i>\"\nshows that in its sense the object <i>a</i> occurs, two\npropositions \"<i>fa</i>\" and \"<i>ga</i>\" that they are both\nabout the same object.\nIf two propositions contradict one another, this is\nshown by their structure; similarly if one follows from\nanother, etc."},{"href":"t41212en.html","id":"41212","name":"4.1212","content":"What <i>can</i> be shown <i>cannot</i> be said."},{"href":"t41213en.html","id":"41213","name":"4.1213","content":"Now we understand our feeling that we are in\npossession of the right logical conception, if only all is\nright in our symbolism."}],"id":"4121","name":"4.121","content":"Propositions cannot represent the logical form:\nthis mirrors itself in the propositions.\nThat which mirrors itself in language, language cannot\nrepresent.\nThat which expresses <i>itself</i> in language, <i>we</i>\ncannot express by language.\nThe propositions <i>show</i> the logical form of reality.\nThey exhibit it."},{"href":"t4122en.html","children":[{"href":"t41221en.html","id":"41221","name":"4.1221","content":"An internal property of a fact we also call a\nfeature of this fact.  (In the sense in which we speak of\nfacial features.)"}],"id":"4122","name":"4.122","content":"We can speak in a certain sense of formal\nproperties of objects and atomic facts, or of properties of the\nstructure of facts, and in the same sense of formal relations\nand relations of structures.\n(Instead of property of the structure I also say\n\"internal property\"; instead of relation\nof structures \"internal relation\".\nI introduce these expressions in order to show the\nreason for the confusion, very widespread among philosophers,\nbetwen internal relations and proper (external) relations.)\nThe holding of such internal properties and relations\ncannot, however, be asserted by propositions, but it shows\nitself in the propositions, which present the facts and treat\nof the objects in question."},{"href":"t4123en.html","id":"4123","name":"4.123","content":"A property is internal if it is unthinkable that\nits object does not possess it.\n(This bright blue colour and that stand in the internal\nrelation of bright and darker eo ipso.  It is unthinkable that\n<i>these</i> two objects should not stand in this relation.)\n(Here to the shifting use of the words \"property\" and\n\"relation\" there corresponds the shifting use of the word\n\"object\".)"},{"href":"t4124en.html","children":[{"href":"t41241en.html","id":"41241","name":"4.1241","content":"One cannot distinguish forms from one another by\nsaying that one has this proerty, the other that: for this\nassumes that there is a sense in asserting either property of\neither form."}],"id":"4124","name":"4.124","content":"The existence of an internal property of a\npossible state of affairs is not expressed by a proposition,\nbut it expresses itself in the proposition which presents that\nstate of affairs, by an intern al property of this proposition.\nIt would be as senseless to ascribe a formal property\nto a proposition as to deny it the formal property."},{"href":"t4125en.html","children":[{"href":"t41251en.html","id":"41251","name":"4.1251","content":"Now this settles the disputed question\n\"whether all relations are internal or\nexternal\"."},{"href":"t41252en.html","id":"41252","name":"4.1252","content":"Series which are ordered by <i>internal</i>\nrelations I call formal series.\nThe series of numbers is ordered not by an external, but\nby an internal relation.\nSimilarly the series of propositions \"<i>aRb</i>\",\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�:�<i>aRx�.�xRb</i>\",\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x,�y</i>)�:�<i>aRx�.�xRy�.�yRb</i>\", etc.\n(If <i>b</i> stands in one of these relations to <i>a</i>, I\ncall <i>b</i> a successor of <i>a</i>.)"}],"id":"4125","name":"4.125","content":"The existence of an internal relation between\npossible states of affairs expresses itself in language by an\ninternal relation between the propositions presenting them."},{"href":"t4126en.html","id":"4126","name":"4.126","content":"In the sense in which we speak of formal\nproperties we can now speak also of formal concepts.\n(I introduce this expression in order to make clear the\nconfusion of formal concepts with proper concepts which runs\nthrough the whole of the old logic.)\nThat anything falls under a formal concept as an\nobject belonging to it, cannot be expressed by a proposition.\nBut it is shown in the symbol for the object itself.  (The name\nshows that it signifies an object, the numerical sign that it\nsignifies a number, etc.)\nFormal concepts, cannot, like proper concepts, be\npresented by a function.\nFor their characteristics, the formal properties, are\nnot expressed by the functions.\nThe expression of a formal property is a feature of\ncertain symbols.\nThe sign that signifies the charcteristics of a formal\nconcept is, therefore, a characteristic feature of all symbols,\nwhose meanings fall under the concept.\nThe expression of the formal concept is therefore a\npropositional variable in which only this characteristic\nfeature is constant."},{"href":"t4127en.html","children":[{"href":"t41271en.html","id":"41271","name":"4.1271","content":"Every variable is the sign of a formal concept.\nFor every variable presents a constant form, which all\nits values possess, and which can be conceived as a formal\nproperty of these values."},{"href":"t41272en.html","children":[{"href":"t412721en.html","id":"412721","name":"4.12721","content":"The formal concept is already given with an\nobject, which falls under it.  One cannot, therefore, introduce\nboth, the objects which fall under a formal concept <i>and</i> the\nformal concept itself, as primitive ideas.  One cannot,\ntherefore, <i>e.g.</i> introduce (as Russell does) the concept of\nfunction and also special functions as primitive ideas; or the\nconcept of number and definite numbers."}],"id":"41272","name":"4.1272","content":"So the variable name \"<i>x</i>\" is the proper sign\nof the pseudo-concept <i>object</i>.\nWherever the word \"object\" (\"thing\", \"entity\", etc.)\nis rightly used, it is expressed in logical symbolism by the\nvariable name.\nFor example in the proposition \"there are two objects\nwhich�.�.�.\", by \"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x,�y</i>)�.�.�.\".\nWherever it is used otherwise, <i>i.e.</i> as a proper\nconcept word, there arise senseless pseudo-propositions.\nSo one cannot, <i>e.g.</i> say \"There are objects\" as one\nsays \"There are books\".  Nor \"There are 100 objects\" or\n\"There are <img src=\"ucaleph.gif\" alt=\"�ALEPH�\"><sub>0</sub> objects\".\nAnd it is senseless to speak of the <i>number of all\nobjects</i>.\nThe same holds of the words \"Complex\", \"Fact\",\n\"Function\", \"Number\", etc.\nThey all signify formal concepts and are presented in\nlogical symbolism by variables, not by functions or classes (as\nFrege and Russell thought).\nExpressions like \"1 is a number\",\n\"there is only one number nought\", and\nall like them are senseless.\n(It is as senseless to say, \"there is only\none 1\" as it would be to say: 2�+�2 is at 3 o'clock equal to 4.)"},{"href":"t41273en.html","id":"41273","name":"4.1273","content":"If we want to express in logical symbolism the\ngeneral proposition \"<i>b</i> is a successor of\n<i>a</i>\" we need for this an expression for the\ngeneral term of the formal series: <i>aRb</i>,\n(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�:�<i>aRx�.�xRb</i>,\n(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x,�y</i>)�:�<i>aRx�.�xRy�.�yRb</i>,�.�.�.\nThe general term of a formal series can only be expressed by a\nvariable, for the concept symbolized by \"term of\nthis formal series\" is a <i>formal</i> concept.  (This\nFrege and Russell overlooked; the way in which they express\ngeneral propositions like the above is, therefore, false; it\ncontains a vicious circle.)\nWe can determine the general term of the formal series\nby giving its first term and the general form of the operation,\nwhich generates the following term out of the preceding\nproposition."},{"href":"t41274en.html","id":"41274","name":"4.1274","content":"The question about the existence of a formal\nconcept is senseless.  For no proposition can answer such a\nquestion.\n(For example, one cannot ask: \"Are there\nunanalysable subject-predicate propositions?\")"}],"id":"4127","name":"4.127","content":"The propositional variable signifies the formal\nconcept, and its values signify the objects which fall under\nthis concept."},{"href":"t4128en.html","id":"4128","name":"4.128","content":"The logical forms are <i>anumerical</i>.\nTherefore there are in logic no pre-eminent numbers,\nand therefore there is no philosophical monism or dualism, etc."}],"id":"4012","name":"4.012","content":"It is obvious that we perceive a proposition of\nthe form <i>aRb</i> as a picture.  Here the sign is obviously a\nlikeness of the signified."},{"href":"t4013en.html","id":"4013","name":"4.013","content":"And if we penetrate to the essence of this\npictorial nature we see that his is not disturbed by\n<i>apparent irregularities</i> (like the use of <img src=\"mussharp.gif\" alt=\"�musical sharp�\"> and <img src=\"musflat.gif\" alt=\"�musical-flat�\">\nin the score).\nFor these irregularities also picture what they are to\nexpress; only in another way."},{"href":"t4014en.html","children":[{"href":"t40141en.html","id":"40141","name":"4.0141","content":"In the fact that there is a general rule by which\nthe musician is able to read the symphony out of the score, and\nthat there is a rule by which one could reconstruct the\nsymphony from the line on a gramophone reord and from this\nagain -- by means of the first rule -- construct the score,\nherein lies the internal similarity between these things which\nat first sight seem to be entirely different.  And the rule is\nthe law of projection which projects the symphony into the\nlanguage of the musical score.  It is the rule of translation\nof this language into the language of the gramophone record."}],"id":"4014","name":"4.014","content":"The gramophone record, the musical thought, the\nscore, the waves of sound, all stand to one another in that\npictorial internal relation, which holds between language and\nthe world.\nTo all of them the logical structure is common.\n(Like the two youths, their two horses and their lilies\nin the story.  They are all in a certain sense one.)"},{"href":"t4015en.html","id":"4015","name":"4.015","content":"The possibility of all similes, of all the images\nof our language, rests on the logic of representation."},{"href":"t4016en.html","id":"4016","name":"4.016","content":"In order to understand the essence of the\nproposition, consider hieroglyphic writing, which pictures the\nfacts it describes.\nAnd from it came the alphabet without the essence of\nthe representation being lost."}],"id":"4001","name":"4.001","content":"The totality of propositions is the language."},{"href":"t4002en.html","children":[{"href":"t4021en.html","children":[{"href":"t4211en.html","id":"4211","name":"4.211","content":"It is a sign of an elementary proposition, that no\nelementary proposition can contradict it."}],"id":"4021","name":"4.021","content":"The proposition is a picture of reality, for I\nknow the state of affaires presented by it, if I understand the\nproposition.  And I understand the proposition, without its\nsense having been explained to me."},{"href":"t4022en.html","children":[{"href":"t4221en.html","children":[{"href":"t42211en.html","id":"42211","name":"4.2211","content":"Even if the world is infinitely complex, so that\nevery fact consists of an infinite number of atomic facts and\nevery atomic fact is composed of an infinite number of\nobjects, even then there must be objects and atomic facts."}],"id":"4221","name":"4.221","content":"It is obvious that in the analysis of propositions\nwe must come to elementary propositions, which consist of names\nin immediate combination.\nThe question arises here, how the propositional\nconnexion comes to be."}],"id":"4022","name":"4.022","content":"The proposition <i>shows</i> its sense.\nThe proposition <i>shows</i> how things stand, <i>if</i> it\nis true.  And it <i>says</i>, that they do so stand."},{"href":"t4023en.html","id":"4023","name":"4.023","content":"The proposition determines reality to this extent,\nthat one only needs to say \"Yes\" or\n\"No\" to it to make it agree with reality.\nReality must therefore be completely described by the\nproposition.\nA proposition is the description of a fact.\nAs the description of an object describes it by its\nexternal properties so propositions describe reality by its\ninternal properties.\nThe proposition constructs a world with the help of a\nlogical scaffolding, and therefore one can actually see in the\nproposition all the logical features possessed by reaility\n<i>if</i> it is true.  One can <i>draw conclusions</i> from a false\nproposition."},{"href":"t4024en.html","children":[{"href":"t4241en.html","id":"4241","name":"4.241","content":"If I use two signs with one and the same meaning,\nI express this by putting between them the sign \"=\".\n\"<i>a</i>=<i>b</i>\" means then, that\nthe sign \"<i>a</i>\" is replaceable by the\nsign \"<i>b</i>\".\n(If I introduce by an equation a new sign \"<i>b</i>\",\nby determining that it shall replace a previously known sign\n\"<i>a</i>\", I write the equation -- definition -- (like\nRussell) in the form \"<i>a</i>=<i>b</i> Def.\".  A definition\nis a symbolic rule.)"},{"href":"t4242en.html","id":"4242","name":"4.242","content":"Expressions of the form \"<i>a</i>=<i>b</i>\" are\ntherefore only expedients in presentation: They assert nothing\nabout the meaning of the signs \"<i>a</i>\" and \"<i>b</i>\"."},{"href":"t4243en.html","id":"4243","name":"4.243","content":"Can we understand two names without knowing\nwhether they signify the same thing o r two different things?\nCan we understand a proposition in which two names occur,\nwithout knowing if they mean the same or different things?\nIf I know the meaning of an English and a synonymous\nGerman word, it is impossible for me not to know that they are\nsynonymous, it is impossible for me not to be able to translate\nthem into one another.\nExpressions like \"<i>a</i>=<i>a</i>\",\nor expressions deduced from these are neither elementary\npropositions nor otherwise significant signs.  (This will be\nshown later.)"}],"id":"4024","name":"4.024","content":"To understand a proposition means to know what is\nthe case, if it is true.\n(One can therefore understand it without knowing\nwhether it is true or not.)\nOne understands it if one understands it consituent\nparts."},{"href":"t4025en.html","id":"4025","name":"4.025","content":"The translation of one language into another is\nnot a process of translating each proposition of the one into a\nproposition of the other, but only the consituent parts of\npropositions are translated.\n(And the dictionary does not only translate\nsubstantives but also adverbs and conjunctions, etc., and it\ntreats them all alike.)"},{"href":"t4026en.html","id":"4026","name":"4.026","content":"The meanings of the simple signs (the words) must\nbe explained to us, if we are to understand them.\nBy means of propositions we explain ourselves."},{"href":"t4027en.html","id":"4027","name":"4.027","content":"It is essential to propositions, that they can\ncommunicate a <i>new</i> sense to us."},{"href":"t428en.html","id":"428","name":"4.28","content":"To these combinations correspond the same number of\npossibilities of the truth -- and falsehood -- of <i>n</i>\nelementary propositions."}],"id":"4002","name":"4.002","content":"Man possesses the capacity of constructing\nlanguages, in which every sense can be expressed, without\nhaving an idea how and what each word means -- jsut as one\nspeaks without knowing how the single sounds are produced.\nColloquial language is a part of the human organism and\nis not less complicated than it.\nFrom it it is humanly impossible to gather immediately\nthe logical of language.\nLanguage disguises the thought; so that from the\nexternal form of the clothes one cannot infer the form of the\nthought they clothe, because the external form of the clothes\nis constructed with quite another object than to let the form\nof the body be recog nized.\nThe silent adjustments to understand colloquial\nlanguage are enormously complicated."},{"href":"t4003en.html","children":[{"href":"t40031en.html","children":[{"href":"t40311en.html","id":"40311","name":"4.0311","content":"One name stands for one thing, and another for\nanother thing, and they are connected together.  And so the\nwhole, like a living picture, presents the atomic fact."},{"href":"t40312en.html","id":"40312","name":"4.0312","content":"The possibility of propositions is based upon the\nprinciple of the representation of objects by signs.\nMy fundamental thought is that the \"logical\nconstants\" do not represent.  That the <i>logic</i> of\nthe facts cannot be represented."}],"id":"40031","name":"4.0031","content":"All philosophy is \"Critique of\nlanguage\" (but not at all in Mathner's\nsense).  Russell's merit is to have shown that the\napparent logical form of the proposition need not be its real\nform."},{"href":"t4032en.html","id":"4032","name":"4.032","content":"The proposition is a picture of its state of\naffairs, only in so far as it is logically articulated.\n(Even the proposition \"ambulo\" is\ncomposite, for its stem gives a different sense with another\ntermination, or its termination with another stem.)"}],"id":"4003","name":"4.003","content":"Most propositions and questions, that have been\nwritten about philosophical matters, are not false, but\nsenseless.  We cannot, therefore, answer questions of this kind\nat all, but only state their senselessness.  Most questions and\npropositions of t he philosophers result from the fact that we\ndo not understand the logic of our language.\n(They are of the same kind as the question whether the\nGood is more or less identical than the Beautiful.)\nAnd so it is not to be wondered at that the deepest\nproblems are really <i>no</i> problems."},{"href":"t404en.html","children":[{"href":"t4041en.html","children":[{"href":"t40411en.html","id":"40411","name":"4.0411","content":"If we tried, for example, to express what is\nexpressed by \"(<i>x</i>)�.�<i>fx</i>\" by putting\nan index before <i>fx</i>, like: \"Gen.\n<i>fx</i>\", it would not do, we should not know what\nwas generalized.  If we tried to show it by an index <i>g</i>,\nlike: \"<i>f</i>(<i>x</i><i><sub>g</sub></i>)\" it would\nnot do -- we should not know the scope of the generalization.\nIf we were to try it by introducing a mark in the\nargument places, like\n\"(<i>G</i>,�<i>G</i>)�.�<i>F</i>�(<i>G</i>,�<i>G</i>)\",\nit would not do -- we could not determine\nthe identity of the variables, etc.\nAll these ways of symbolizing are inadequate because\nthey have not the necessary mathematical multiplicity."},{"href":"t40412en.html","id":"40412","name":"4.0412","content":"For the same reason the idealist explanation of\nthe see of spatial relations through \"spatial\nspectacles\" does not do, because it cannot explain\nthe multiplicity of these relations."}],"id":"4041","name":"4.041","content":"This mathematical multiplicity naturally cannot in\nits turn be represented.  One cannot get outside it in the\nrepresentation."},{"href":"t442en.html","id":"442","name":"4.42","content":"With regard to the agreement and disagreement of a\nproposition with the truth-possibilities of <i>n</i> elementary\npropositions there are\n<img src=\"form442.gif\" alt=\"SUMMATION(kappa=0 to Kn, binom-coeff(Kn over kappa) = Ln\">\npossibilities."},{"href":"t443en.html","children":[{"href":"t4431en.html","id":"4431","name":"4.431","content":"The expression of the agreement and disagreement\nwith the truth-possibilities of the elementary propositions\nexpresses the truth-conditions of the proposition.\nThe proposition is the expression of its\ntruth-conditions.\n(Frege has therefore quite rightly put them at the\nbeginning, as explaining the signs of his logical symbolism.\nOnly Frege's explanation of the truth-concept is false:\nif \"the true\" and \"the\nfalse\" were real objects and the arguments in\n~<i>p</i>, etc., then the sense of ~<i>p</i> would by no means be\ndetermined by Frege's determination.)"}],"id":"443","name":"4.43","content":"Agreement with the truth-possibilities can be\nexpressed by co-ordinating with them in the scheme the mark\n\"T\" (true).\nAbsence of this mark means disagreement."},{"href":"t444en.html","children":[{"href":"t4441en.html","id":"4441","name":"4.441","content":"It is clear that to the complex of the signs\n\"F\" and \"T\" no\nobject (or complex of objects) corresponds; any more than to\nhorizontal and vertical lines or to brackets.  There are no\n\"logical objects\".\nSomething analogous holds of course for all signs,\nwhich express the same as the schemata of \"T\" and \"F\"."},{"href":"t4442en.html","id":"4442","name":"4.442","content":"Thus <i>e.g.</i> ``\n<br>\n<center>\n<table border>\n<tr>\n    <td>p</td>\n    <td>q</td>\n    <td>�</td>\n</tr>\n<tr>\n    <td>T</td>\n    <td>T</td>\n    <td>T</td>\n</tr>\n<tr>\n    <td>F</td>\n    <td>T</td>\n    <td>T</td>\n</tr>\n<tr>\n    <td>T</td>\n    <td>F</td>\n    <td>�</td>\n</tr>\n<tr>\n    <td>F</td>\n    <td>F</td>\n    <td>F</td>\n</tr>\n</table>\n</center>\n<br>'' is a propositional sign.\n(Frege's assertion sign \"<img src=\"assert.gif\" alt=\"�|-�\">\" is logically\naltogether meaningless; in Frege (and Russell) it only shows\nthat these authors hold as true the propositions marked in this\nway.\n\"<img src=\"assert.gif\" alt=\"�|-�\">\" belongs therefore to the\npropositions no more than does the number of the proposition.\nA proposition cannot possible assert of itself that it is true.)\nIf the sequence of the truth-possibilities in the\nscheme is once for all determined by a rule of combination,\nthen the last column is by itself an expression of the\ntruth-conditions.  If we write this column as a row the\npropositional sign becomes: \"(T�T�-�T)(<i>p,�q</i>)\", or more\nplainly: \"(T�T�F�T)(<i>p,�q</i>)\".\nThe number of places in the left-hand bracket is\ndetermined by the number of terms in the right-hand bracket.)"}],"id":"444","name":"4.44","content":"The sign which arises from the co-ordination of\nthat mark \"T\" with the\ntruth-possibilities is a propositional sign."},{"href":"t445en.html","id":"445","name":"4.45","content":"For <i>n</i> elementary propositions there are\n<i>L</i><i><sub>n</sub></i> possible groups of truth-conditions.\nThe groups of truth-conditions which belong to the\ntruth-possibilities of a number of elementary propositions can\nbe ordered in a series."},{"href":"t446en.html","children":[{"href":"t4461en.html","children":[{"href":"t44611en.html","id":"44611","name":"4.4611","content":"Tautology and contradiction are, however, not\nnonsensical; they are part of the symbolism, in the same way\nthat \"0\" is part of the symbolism of\nArithmetic."}],"id":"4461","name":"4.461","content":"The proposition shows what it says, the tautology\nand the contradiction that they say nothing.\nThe tautology has no truth-conditions, for it is\nunconditionally true; and the contradiction is on no condition\ntrue.\nTautology and contradiction are without sense.\n(Like the point from which two arrows go out in\nopposite directions.)\n(I know, <i>e.g.</i> nothing about the weather, when I\nknow that it rains or does not rain.)"},{"href":"t4462en.html","id":"4462","name":"4.462","content":"Tautology and contradiction are not pictures of\nthe reality.  They present no possible state of affairs.  For\nthe one allows <i>every</i> possible state of affairs, the other\n<i>none</i>.\nIn the tautology the conditions of agreement with the\nworld -- the presenting relations -- cancel one another, so\nthat it stands in no presenting relation to reality."},{"href":"t4463en.html","id":"4463","name":"4.463","content":"The truth-conditions determine the range, which is\nleft to the facts by the proposition.\n(The proposition, the picture, the modem, are in a\nnegative sense like a solid body, which restricts the free\nmovement of another: in a positive sense, like the space\nlimited by solid substance, in which a body may be placed.)\nTautology leaves to reality the whole infinite logical\nspace; contradiction fills the whole logical space and leaves\nno point to reality.  Neither of them, therefore, can in any\nway determine reality."},{"href":"t4464en.html","id":"4464","name":"4.464","content":"The truth of tautology is certain, of propositions\npossible, of contradiction impossible.\n(Certain, possible, impossible: here we have an\nindication of that gradation which we need in the theory of\nprobability.)"},{"href":"t4465en.html","id":"4465","name":"4.465","content":"The logical product of a tautology and a\nproposition says the same as the proposition.  Therefore that\nproduct is identical with the proposition.  For the essence of\nthe symbol cannot be altered without altering its sense."},{"href":"t4466en.html","children":[{"href":"t44661en.html","id":"44661","name":"4.4661","content":"Of course the signs are also combined with one\nanother in the tautology and contradiction, <i>i.e.</i> they stand\nin relations to one another, but these relations are\nmeaningless, unessential to the <i>symbol</i>."}],"id":"4466","name":"4.466","content":"To a definite logical combination of signs\ncorresponds a definite logical combination of their meanings;\n<i>every arbitrary</i> combination only corresponds to the\nunconnected signs.\nThat is, propositions which are true for every stat of\naffairs cannot be combinations of signs at all, for otherwise\nthere could only correspond to them definite combinations of\nobjects.\n(And to no logical combination corresponds <i>no</i>\ncombination of the objects.)\nTautology and contradiction are the limiting cases of\nthe combination of symbols, namely their dissolution."}],"id":"446","name":"4.46","content":"Among the possible groups of truth-conditions there\nare two extreme cases.\nIn the one case the proposition is true for all the\ntruth-possibilities of the elementary propositions.  We say\nthat the truth-conditions are <i>tautological</i>.\nIn the second case the proposition is false for all the\ntruth-possibilities.  The truth-conditions are\n<i>self-contradictory</i>.\nIn the first case we call the proposition a tautology,\nin the second case a contradiction."}],"id":"404","name":"4.04","content":"In the proposition there must be exactly as many\nthing distinguishable as there are in the state of affairs,\nwhich it represents.\nThey must both possess the same logical (mathematical)\nmultiplicity (cf. Hertz's Mechanics, on Dynamic Models)."},{"href":"t405en.html","children":[{"href":"t451en.html","id":"451","name":"4.51","content":"Suppose <i>all</i> elementary propositions were given\nme: then we can simply ask: what propositions I can build out\nof them.  And these are <i>all</i> propositions and <i>so</i> are\nthey limited."},{"href":"t452en.html","id":"452","name":"4.52","content":"The propositions are everything which follows from\nthe totality of all elementary propositions (of course also\nfrom the fact that it is the <i>totality of them all</i>).  (So,\nin some sense, one could say, that <i>all</i> propositions are\ngeneralizations of the elementary propositions.)"},{"href":"t453en.html","id":"453","name":"4.53","content":"The general proposition form is a variable."}],"id":"405","name":"4.05","content":"Reality is compared with the proposition."},{"href":"t406en.html","children":[{"href":"t4061en.html","id":"4061","name":"4.061","content":"If one does not observer that propositions have a\nsense independent of the facts, one can easily believe that\ntrue and false are two relations between signs and things\nsignified with equal rights.\nOne could, then, for example, say that \"<i>p</i>\"\nsignifies in the true way what \"~<i>p</i>\" signifies in the\nfalse way, etc."},{"href":"t4062en.html","children":[{"href":"t40621en.html","id":"40621","name":"4.0621","content":"That, however, the signs \"<i>p</i>\" and\n\"~<i>p</i>\" <i>can</i> say the same thing is important, for it\nshows that the sign \"~\" corresponds to nothing in reality.\nThat negation occurs in a proposition, is no\ncharacteristic of its sense (~~<i>p</i>�=�<i>p</i>).\nThe propositions \"<i>p</i>\" and\n\"~<i>p</i>\" have opposite senses, but to\nthem corresponds one and the same reality."}],"id":"4062","name":"4.062","content":"Can we not make ourselves understood by means of\nfalse propositions as hitherto with true ones, so long as we\nknow that they are meant to be false?  No!  For a proposition\nis true, if what we assert by means of it is the case; and if\nby \"<i>p</i>\" we mean ~<i>p</i>, and what we\nmean is the case, then \"<i>p</i>\" in the\nnew conception is true and not false."},{"href":"t4063en.html","id":"4063","name":"4.063","content":"An illustration to explain the concept of truth.\nA black spot on white paper; the form of the spot can be\ndescribed by saying of each point of the plane whether it is\nwhite or black.  To the fact that a point is black corresponds\na positive fact; to the fact that a point is white (not black),\na negative fact.  If I indicate a point of the plane (a\ntruth-value in Frege's terminology), this corresponds to\nthe assumption proposed for judgement, etc. etc.\nBut to be able to say that a point is black or white, I\nmust first know under what conditions a point is called white\nor black; in order to be able to say \"<i>p</i>\" is true (or\nfalse) I must have determined under what conditions I call\n\"<i>p</i>\" true, and thereby I determine the sense of the\nproposition.\nThe point at which the simile breaks down is this: we\ncan indicate a point on the paper, without know what white and\nblack are; but to a proposition without a sense corresponds n\nothing at all, for it signifies no thing (truth-value) whose\nproperties are called \"false\" or\n\"true\"; the verb of the proposition is\nnot \"is true\" or \"is\nfalse\" -- as Frege thought -- but that which\n\"is true\" must already contain the verb."},{"href":"t4064en.html","children":[{"href":"t40641en.html","id":"40641","name":"4.0641","content":"One could say, the denial is already related to\nthe logical place determined by the proposition that is denied.\nThe denying proposition determines a logical place\n<i>other</i> than does the proposition denied.\nThe denying proposition determines a logical place,\nwith the help of the logical place of the proposition denied,\nby saying that it lies outside the latter place.\nThat one can deny again the denied proposition, shows\nthat what is denied is already a proposition and not merely the\npreliminary to a proposition."}],"id":"4064","name":"4.064","content":"Every proposition must <i>already</i> have a sense;\nassertion cannot give it a sense, for what it asserts is the\nsense itself.  And the same holds of denial, etc."}],"id":"406","name":"4.06","content":"Propositions can be true or false only by being\npictures of the reality."}],"id":"4","name":"4","content":"The thought is the significant proposition."},{"href":"t5en.html","children":[{"href":"t501en.html","children":[{"href":"t5101en.html","id":"5101","name":"5.101","content":"The truth-functions of every number of elementary\npropositions can be written in a scheme of the following kind:\n\n<table border>\n<tr>\n    <td>(T T T T)(<i>p, q</i>)</td>\n    <td>Tautology (if <i>p</i> then <i>p</i>, and if <i>q</i> then <i>q</i>)\n    [<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>p</i>�.�<i>q</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(F T T T)(<i>p, q</i>)</td>\n    <td>in words: Not both <i>p</i> and <i>q</i>.\n    [~(<i>p</i>�.�<i>q</i>)]</td>\n</tr>\n<tr>\n    <td>(T F T T)(<i>p, q</i>)</td>\n    <td>����''����''����If <i>q</i> then <i>p</i>.\n    [<i>q</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>p</i>]</td>\n</tr>\n<tr>\n    <td>(T T F T)(<i>p, q</i>)</td>\n    <td>����''����''����If <i>p</i> then <i>q</i>.\n    [<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(T T T F)(<i>p, q</i>)</td>\n    <td>����''����''����<i>p</i> or <i>q</i>.\n    [<i>p</i>�v�<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(F F T T )(<i>p, q</i>)</td>\n    <td>����''����''����Not <i>q</i>.\n    [~<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(F T F T)(<i>p, q</i>)</td>\n    <td>����''����''����Not <i>p</i>.\n    [~<i>p</i>]</td>\n</tr>\n<tr>\n    <td>(F T T F)(<i>p, q</i>)</td>\n    <td>����''����''����<i>p</i> or <i>q</i>,\n    but not both.\n    [<i>p</i>�.�~<i>q</i>�:v:�<i>q</i>�.�~<i>p</i>]</td>\n</tr>\n<tr>\n    <td>(T F F T)(<i>p, q</i>)</td>\n    <td>����''����''����If <i>p</i>, then <i>q</i>;\n    and if <i>q</i>, then <i>p</i>.\n    [<i>p</i>�<img src=\"equiv.gif\" alt=\"�==�\">�<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(T F T F)(<i>p, q</i>)</td>\n    <td>����''����''����<i>p</i></td>\n</tr>\n<tr>\n    <td>(T T F F)(<i>p, q</i>)</td>\n    <td>����''����''����<i>q</i></td>\n</tr>\n<tr>\n    <td>(F F F T)(<i>p, q</i>)</td>\n    <td>����''����''����Neither <i>p</i> nor <i>q</i>.\n    [<i>p</i>�.�~<i>q</i> or <i>p</i>�|�<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(F F T F)(<i>p, q</i>)</td>\n    <td>����''����''����<i>p</i> and not <i>q</i>.\n    [<i>p</i>�.�~<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(F T F F)(<i>p, q</i>)</td>\n    <td>����''����''����<i>q</i> and not <i>p</i>.\n    [<i>q</i>�.�~<i>p</i>]</td>\n</tr>\n<tr>\n    <td>(T F F F)(<i>p, q</i>)</td>\n    <td>����''����''����<i>p</i> and <i>q</i>.\n    [<i>p</i>�.�<i>q</i>]</td>\n</tr>\n<tr>\n    <td>(F F F F)(<i>p, q</i>)</td>\n    <td>Contradiction (<i>p</i> and not <i>p</i>; and <i>q</i>\n    and not <i>q</i>.)\n    [<i>p</i>�.�~<i>p</i>�.�<i>q</i>�.�~<i>q</i>]</td>\n</tr>\n</table>\nThose truth-possibilities of its truth-arguments, which\nverify the proposition, I shall call its <i>truth-grounds</i>."},{"href":"t512en.html","children":[{"href":"t5121en.html","id":"5121","name":"5.121","content":"The truth-grounds of <i>q</i> are contained in those\nof <i>p</i>; <i>p</i> follows from <i>q</i>."},{"href":"t5122en.html","id":"5122","name":"5.122","content":"If <i>p</i> follows from <i>q</i>, the sense of\n\"<i>p</i>\" is contained in that of\n\"<i>q</i>\"."},{"href":"t5123en.html","id":"5123","name":"5.123","content":"If a god creates a world in which certain\npropositions are true, he creates thereby also a world in which\nall propositions consequent on them are true.  And similarly he\ncould not create a world in which the proposition \"<i>p</i>\" is\ntrue without creating all its objects."},{"href":"t5124en.html","children":[{"href":"t51241en.html","id":"51241","name":"5.1241","content":"\"<i>p�.�q</i>\" is one of the\npropositions which assert \"<i>p</i>\" and at\nthe same time one of the propositions which assert \"<i>q</i>\".\nTwo propositions are opposed to one another if there is\nno significant proposition which asserts them both.\nEvery proposition which contradicts another, denies it."}],"id":"5124","name":"5.124","content":"A proposition asserts every proposition which\nfollows from it."}],"id":"512","name":"5.12","content":"In particular the truth of a proposition <i>p</i>\nfollows from that of a proposition <i>q</i>, if all the\ntruth-grounds of the second are truth-grounds of the first."},{"href":"t513en.html","children":[{"href":"t5131en.html","children":[{"href":"t51311en.html","id":"51311","name":"5.1311","content":"When we conclude from <i>p</i>�v�<i>q</i> and\n~<i>p</i> to <i>q</i> the relation between the forms of the\npropositions \"<i>p</i>�v�<i>q</i>\" and\n\"~<i>p</i>\" is here concealed by the method\nof symbolizing.  But if we write, <i>e.g.</i> instead of\n\"<i>p</i>�v�<i>q</i>\"\n\"<i>p</i>�|�<i>q</i>�.|.�<i>p</i>�|�<i>q</i>\" and instead of\n\"~<i>p</i>\"\n\"<i>p</i>�|�<i>p</i>\" (<i>p</i>�|�<i>q</i> = neither <i>p</i> nor\n<i>q</i>), then the inner connexion becomes obvious.\n(The fact that we can infer <i>fa</i> from (<i>x</i>)�.�<i>fx</i>\nshows that generality is present also in the symbol\n\"(<i>x</i>)�.�<i>fx</i>\"."}],"id":"5131","name":"5.131","content":"If the truth of one proposition follows from the\ntruth of others, this expresses itself in relations in which\nthe forms of these propositions stand to one another, and we\ndo not need to put them in these relations first by connecting\nthem with one another in a proposition; for these relations are\ninternal, and exist as soon as, and by the very fact that, the\npropositions exist."},{"href":"t5132en.html","id":"5132","name":"5.132","content":"If <i>p</i> follows from <i>q</i>, I can conclude from\n<i>q</i> to <i>p</i>; infer <i>p</i> from <i>q</i>.\nThe method of inference is to be understood from the\ntwo propositions alone.\nOnly they themselves can justify the inference.\nLaws of inference, which -- as in Frege and Russell --\nare to justify the conclusions, are senseless and would be\nsuperfluous."},{"href":"t5133en.html","id":"5133","name":"5.133","content":"All inference takes place a priori."},{"href":"t5134en.html","id":"5134","name":"5.134","content":"From an elementary proposition no other can be\ninferred."},{"href":"t5135en.html","id":"5135","name":"5.135","content":"In no way can an inference be made from the\nexistence of one state of affairs to the existence of another\nentirely different from it."},{"href":"t5136en.html","children":[{"href":"t51361en.html","id":"51361","name":"5.1361","content":"The events of the future <i>cannot</i> be inferred\nfrom those of the present.\nSuperstition is the belief in the causal nexus."},{"href":"t51362en.html","id":"51362","name":"5.1362","content":"The freedom of the will consists in the fact that\nfuture actions cannot be known now.  We could only know them if\ncausality were an <i>inner</i> necessity, like that of logical\ndeduction. -- The connexion of knowledge and what is known is\nthat of logical necessity.\n(\"A knows that <i>p</i> is the case\"\nis senseless if <i>p</i> is a tautology.)"},{"href":"t51363en.html","id":"51363","name":"5.1363","content":"If from the fact that a proposition is obvious to\nus it does not <i>follow</i> that it is true, then obviousness is\nno justification for our belief in its truth."}],"id":"5136","name":"5.136","content":"There is no causal nexus which justifies such an\ninference."}],"id":"513","name":"5.13","content":"That the truth of one proposition follows from the\ntruth of other propositions, we perceive from the structure of\nthe propositions."},{"href":"t514en.html","children":[{"href":"t5141en.html","id":"5141","name":"5.141","content":"If <i>p</i> follows from <i>q</i> and <i>q</i> from <i>p</i>\nthen they are one and the same proposition."},{"href":"t5142en.html","id":"5142","name":"5.142","content":"A tautology follows from all propositions: it says\nnothing."},{"href":"t5143en.html","id":"5143","name":"5.143","content":"Contradiction is something shared by propositions,\nwhich <i>no</i> proposition has in common with another.  Tautology\nis that which is shared by all propositions, which have nothing\nin common with one another.\n\nContradiction vanishes so to speak outside, tautology\ninside all propositions.\nContradiction is the eternal limit of the propositions,\ntautology their substanceless centre."}],"id":"514","name":"5.14","content":"If a proposition follows from another, then the\nlatter says more than the former, the former less than the\nlatter."},{"href":"t515en.html","children":[{"href":"t5151en.html","children":[{"href":"t51511en.html","id":"51511","name":"5.1511","content":"There is no special object peculiar to\nprobability propositions."}],"id":"5151","name":"5.151","content":"Suppose in a scheme like that above in No.\n<a href=\"t5101en.html\">5.101</a>\n<i>T<sub>r</sub></i> is the number of the \"T\"'s in the\nproposition <i>r</i>, <i>T<sub>rs</sub></i> the number of those\n\"T\"'s in the proposition <i>s</i>, which stand in the same columns\nas \"T\"'s of the proposition <i>r</i>; then the proposition <i>r</i>\ngives to the proposition <i>s</i> the probability\n<i>T<sub>rs</sub>�:�T<sub>r</sub></i>."},{"href":"t5152en.html","id":"5152","name":"5.152","content":"Propositions which have no truth-arguments in\ncommon with one another we call independent.\nTwo elementary propositions give to one another the\nprobability 1/2.\nIf <i>p</i> follows from <i>q</i>, the proposition <i>q</i>\ngives to the proposition <i>p</i> the probability 1.  The\ncertainty of logical conclusion is a limiting case of\nprobability.\n(Application to tautology and contradiction.)"},{"href":"t5153en.html","id":"5153","name":"5.153","content":"A proposition is in itself neither probable nor\nimprobable.  An even occurs or does not occur, there is no\nmiddle course."},{"href":"t5154en.html","id":"5154","name":"5.154","content":"In an urn there are equal numbers of white and\nblack balls (and no others).  I draw on ball after another and\nput them back in the urn.  Then I can determine by the\nexperiment that the numbers of the black and white balls which\nare drawn approximate as the drawing continues.\nSo <i>this</i> is not a mathematical fact.\nIf then, I say, It is equally probable that I should d\nraw a white and a black ball, this means, All the circumstances\nknown to me (including the natural laws hypothetically assumed)\ngive to the occurrence of the one event no more probability\nthan to the occurrence of the other.  That is they give -- as\ncan easily be understood from the above explanations -- to\neach the probability 1/2.\nWhat I can verify by the experiment is that the\noccurrence of the two events is independent of the\ncircumstances with which I have no closer acquaintance."},{"href":"t5155en.html","id":"5155","name":"5.155","content":"The unit of the probability proposition is: The\ncircumstances -- with which I am not further acquainted -- give\nto the occurrence of a definite event such and such a degree of\nprobability."},{"href":"t5156en.html","id":"5156","name":"5.156","content":"Probability is a generalization.\nIt involves a general description of a propositional\nform.  Only in default of certainty do we need probability.\nIf we are not completely acquainted with a fact, but\nknow <i>something</i> about its form.\n(A proposition can, indeed, be an incomplete picture of\na certain state of affairs, but it is always <i>a</i> complete\npicture.)\nThe probability proposition is, as it were, an extract\nfrom other propositions."}],"id":"515","name":"5.15","content":"If <i>T</i><i><sub>r</sub></i> is the number of the\ntruth-grounds of the proposition \"<i>r</i>\",\n<i>T</i><i><sub>rs</sub></i> the number of those truth-grounds of\nthe proposition \"<i>s</i>\" which are at the same time\ntruth-grounds of \"<i>r</i>\", then we call the ratio\n<i>T<sub>rs</sub>�:�T<sub>r</sub></i>\nthe measure of the <i>probability</i> which\nthe proposition \"<i>r</i>\" gives to the proposition \"<i>s</i>\"."}],"id":"501","name":"5.01","content":"The elementary propositions are the truth-arguments\nof propositions."},{"href":"t502en.html","children":[{"href":"t521en.html","id":"521","name":"5.21","content":"We can bring out these internal relations in our\nmanner of expression, by presenting a proposition as the result\nof an operation which produces it from other propositions (the\nbases of the operation)."},{"href":"t522en.html","id":"522","name":"5.22","content":"The operation is the expression of a relation\nbetween the structures of its result and its bases."},{"href":"t523en.html","children":[{"href":"t5231en.html","id":"5231","name":"5.231","content":"And that will naturally depend on their formal\nproperties, on the internal similarity of their forms."},{"href":"t5232en.html","id":"5232","name":"5.232","content":"The internal relation which orders a series is\nequivalent to the operation by which one term arises from\nanother."},{"href":"t5233en.html","id":"5233","name":"5.233","content":"The first place in which an operation can occur is\nwhere a proposition arises from another in a logically\nsignificant way; <i>i.e.</i> where the logical construction of the\nproposition begins."},{"href":"t5234en.html","children":[{"href":"t52341en.html","id":"52341","name":"5.2341","content":"The sense of a truth-function of <i>p</i> is a\nfunction of the sense of <i>p</i>.\nDenial, logical addition, logical multiplication, etc.,\netc., are operations.\n(Denial reverses the sense of a proposition.)"}],"id":"5234","name":"5.234","content":"The truth-functions of elementary proposition.\nare results of operations which have the elementary\npropositions as bases.  (I call these operations,\ntruth-operations.)"}],"id":"523","name":"5.23","content":"The operation is that which must happen to a\nproposition in order to make another out of it."},{"href":"t524en.html","children":[{"href":"t5241en.html","id":"5241","name":"5.241","content":"The operation does not characterize a form but\nonly the difference between forms."},{"href":"t5242en.html","id":"5242","name":"5.242","content":"The same operation which makes \"<i>q</i>\" from\n\"<i>p</i>\", makes \"<i>r</i>\" from \"<i>q</i>\", and so on.  This\ncan only be expressed by the fact that \"<i>p</i>\", \"<i>q</i>\",\n\"<i>r</i>\", etc., are variables which give general expression\nto certain formal relations."}],"id":"524","name":"5.24","content":"An operation shows itself in a variable; it shows\nhow we can proceed from one form of proposition to another.\nIt gives expression to the difference between the\nforms.\n(And that which is common the the bases, and the result\nof an operation, is the bases themselves.)"},{"href":"t525en.html","children":[{"href":"t5251en.html","id":"5251","name":"5.251","content":"A function cannot be its own argument, but the\nresult of an operation can be its own basis."},{"href":"t5252en.html","children":[{"href":"t52521en.html","id":"52521","name":"5.2521","content":"The repeated application of an operation to its\nown result I call its successive application (\"<i>O' O' O' a</i>\"\nis the result\nof the threefold successive application of\n\"<i>O'</i>\" to \"<i>a</i>\").\nIn a similar sense I speak of the successive\napplication of <i>several</i> operations to a number of\npropositions."},{"href":"t52522en.html","id":"52522","name":"5.2522","content":"The general term of the formal series <i>a,\nO'�a, O'�O'�a,</i>�.�.�. I write thus:\n\"[<i>a,�x,�O'�x</i>]\".  This\nexpression in brackets is a variable.  The first term of the\nexpression is the beginning of the formal series, the second\nthe form of an arbitrary term <i>x</i> of the series, and the\nthird the form of that term of the series which immediately\nfollws <i>x</i>."},{"href":"t52523en.html","id":"52523","name":"5.2523","content":"The concept of the success application of an\noperation is equivalent to the concept \"and so on\"."}],"id":"5252","name":"5.252","content":"Only in this way is the progress from term to term\nin a formal series possible (from type to type in the hierarchy\nof Russell and Whitehead).  (Russell and Whitehead have not\nadmitted the possibility of this progress but have made use of\nit all the same.)"},{"href":"t5253en.html","id":"5253","name":"5.253","content":"One operation can reverse the effect of another.\nOperations can cancel one another."},{"href":"t5254en.html","id":"5254","name":"5.254","content":"Operations can vanish (<i>e.g.</i> denial in\n\"~~<i>p</i>\".  ~~<i>p</i>�=�<i>p</i>)."}],"id":"525","name":"5.25","content":"The occurrence of an operation does not\ncharacterize the sense of a proposition.\nFor an operation does not assert anything; only its\nresult does, and this depends on the bases of the operation.\n(Operation and function must not be confused with one another.)"}],"id":"502","name":"5.02","content":"It is natural to confuse the arguments of functions\nwith the indices of names.  For I recognize the meaning of the\nsign containing it from the argument just as much as from the\nindex.\nIn Russell's \"+<i><sub>c</sub></i>\", for example,\n\"<i>c</i>\" is an index which indicates that the whole sign is the\naddition sign for cardinal numbers.  But this way of\nsymbolizing depends on arbitrary agreement, and could choose a\nsimple sign instead of \"+<i><sub>c</sub></i>\": but in\n\"~<i>p</i>\" \"<i>p</i>\" is not an index but an argument; the sense\nof \"~<i>p</i>\" <i>cannot</i> be understood, unless the sense of\n\"<i>p</i>\" has previously been understood.  (In the name Julius\nCaesar, Julius is an index.  The index is always part of a\ndescription of the object to whose name we attach it,\n<i>e.g.</i> <i>The</i> Caesar of the Julian gens.)\nThe confusion of argument and index is, if I am not\nmistaken, at the root of Frege's theory of the meaning\nof propositions and functions.  For Frege the propositions of\nlogical were names and their arguments the indices of these\nnames."},{"href":"t53en.html","children":[{"href":"t531en.html","id":"531","name":"5.31","content":"The Schemata No.\n<a href=\"t431en.html\">4.31</a> are also significant, if\n\"<i>p</i>\", \"<i>q</i>\", \"<i>r</i>\", etc. are not elementary\npropositions.\nAnd it is easy to see that the propositional sign in No.\n<a href=\"t442en.html\">4.42</a> expresses one truth-function\nof elementary propositions\neven when \"<i>p</i>\" and \"<i>q</i>\" are truth-functions of elementary\npropositions."},{"href":"t532en.html","id":"532","name":"5.32","content":"All truth-functions are results of the successive\napplication of a finite number of truth-operations to\nelementary propositions."}],"id":"53","name":"5.3","content":"All propositions are results of truth-operations on\nthe elementary propositions.\nThe truth-operation is the way in which a\ntruth-function arises from elementary propositions.\nAccording to the nature of truth-operations, in the\nsame way as out of elementary propositions arise their\ntruth-functions, from truth-functions arises a new one.  Every\ntruth-operation creates from truth-functions of elementary\npropositions, another tru th-function of elementary propositions\n<i>i.e.</i> a proposition.  The result of every truth-operation on\nthe reults of truth-operations on elementary propositions is\nalso the result of <i>one</i> truth-operation on elementary\npropositions.\nEvery proposition is the result of truth-operations on\nelementary propositions."},{"href":"t54en.html","children":[{"href":"t541en.html","id":"541","name":"5.41","content":"For all those results of truth-operations on\ntruth-functions are identical, which are one and the same\ntruth-function of elementary propositions."},{"href":"t542en.html","id":"542","name":"5.42","content":"That v, <img src=\"hook.gif\" alt=\"�HOOK�\">, etc., are not relations in\nthe sense of right and left, etc., is obvious.\nThe possibility of crosswise definition of the logical\n\"primitive signs\" of Frege and Russell\nshows by itself that these are not primitive signs and that\nthey signify no relations.\nAnd it is obvious that the \"<img src=\"hook.gif\" alt=\"�HOOK�\">\" which we define by\nmeans of \"~\" and \"v\" is identical with that by which we\ndefine \"v\" with the help of \"~\", and that this \"v\" is\nthe same as the first, and so on."},{"href":"t543en.html","id":"543","name":"5.43","content":"That from a fact <i>p</i> an infinite number of\n<i>others</i> should follow, namely, ~~<i>p</i>, ~~~~<i>p</i>, etc., is\nindeed hardly to be believed, and it is no less wonderful that\nthe infinite number of propositions of logic (of mathematics)\nshold follow from half a dozen \"primitive\npropositions\".\nBut the propositions of logic say the same thing.  That\nis, nothing."},{"href":"t544en.html","children":[{"href":"t5441en.html","id":"5441","name":"5.441","content":"This disappearance of the apparent logical\nconstants also occurs if\n\"~(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�~<i>fx</i>\" says the same as\n\"(<i>x</i>)�.�<i>fx</i>\", or\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>fx�.�x=a</i>\" the same as\n\"<i>fa</i>\"."},{"href":"t5442en.html","id":"5442","name":"5.442","content":"If a proposition is given to us then the results\nof all truth-opoerations which have it as their basis are given\n<i>with</i> it."}],"id":"544","name":"5.44","content":"Truth-functions are not material functions.\nIf <i>e.g.</i> an affirmation can be produced by repeated\ndenial, is the denial -- in any sense -- contained in the\naffirmation?\nDoes \"~~<i>p</i>\" deny \"~<i>p</i>\", or does it affirm\n<i>p</i>; or both?\nThe proposition \"~~<i>p</i>\" does\nnot treat of denial as an object, but the possibility of denial\nis already prejudged in affirmation.\nAnd if there was an object called \"~\", then\n\"~~<i>p</i>\" would have to say something other than\n\"<i>p</i>\".  For the one proposition would then treat of ~, the\nother would not."},{"href":"t545en.html","children":[{"href":"t5451en.html","id":"5451","name":"5.451","content":"If logic has primitive ideas these must be\nindependent of one another.  If a primitive idea is introduced\nit must be introduced in all contexts in which it occurs at\nall.  One cannot therefore introduce it for <i>one</i> context\nand then again for another.  For example, if denial is\nintroduced, we must understand it in propositions of the form\n\"~<i>p</i>\", just as in propositions like\n\"~(<i>p</i>�v�<i>q</i>)\",\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�~<i>fx</i>\" and others.\nWe may not first introduce it for oone class of cases and then\nfor another, for it would then remain doubtful whether its\nmeaning in the two cases was the same, and there would be no\nreason to use the same way of symbolizing in the two cases.\n(In short, what Frege (\"Grundgesetze der\nArithmetik\") has said about the introduction of\nsigns by definitions holds, mutatis mutandis, for the\nintroduction of primitive signs also.)"},{"href":"t5452en.html","id":"5452","name":"5.452","content":"The introduction of a new expedient in the\nsymbolism of logic must always be an event full of\nconsequences.  No new symbol may be introduced in logic in\nbrackets or in the margin -- with, so to speak, an entirely\ninnocent face.\n(Thus in the \"Principia\nMathematica\" of Russell and Whitehead there occur\ndefinitions and primitive propositions in words.  Why suddenly\nwords here?  This would need a justification.  There was none,\nand can be none for the process is actually not allowed.)\nBut if the introduction of a new expedient has proved\nnecessary in one place, we must immediately ask: Where is this\nexpedient <i>always</i> to be used?  Its position in logic must be\nmade clear."},{"href":"t5453en.html","id":"5453","name":"5.453","content":"All numbers in logic must be capable of\njustification.\nOr rather it must become plain that there are no\nnumbers in logic.\nThere are no pre-eminent numbers."},{"href":"t5454en.html","children":[{"href":"t54541en.html","id":"54541","name":"5.4541","content":"The solution of logical problems must be neat for\nthey set the standard of neatness.\nMen have always thought that there must be a sphere of\nquestions whose answers -- a priori -- are symmetrical and\nunited into a closed regular structure.\nA sphere in which the proposition, simplex sigillum\nveri, is valid."}],"id":"5454","name":"5.454","content":"In logic there is no side by side, there can be no\nclassification.\nIn logic there cannot be a more general and a more\nspecial."}],"id":"545","name":"5.45","content":"If there are logical primitive signs a correct\nlogic must make clear their position relative to one another\nand justify their existence.  The construction of logic <i>out\nof</i> its primitive signs must become clear."},{"href":"t546en.html","children":[{"href":"t5461en.html","children":[{"href":"t54611en.html","id":"54611","name":"5.4611","content":"Logical operation signs are punctuations."}],"id":"5461","name":"5.461","content":"The apparently unimportant fact that the apparent\nrelations like v and <img src=\"hook.gif\" alt=\"�HOOK�\"> need brackets -- unlike real\nrelations -- is of great importance.\nThe use of brackets with these apparent primitive signs\nshows that these are not the real primitive signs; and nobody\nof course would believe that the brackets have meaning by\nthemselves."}],"id":"546","name":"5.46","content":"When we have rightly introduced the logical signs,\nthe sense of all their combinations has been already introduced\nwith them: therefore not only\n\"<i>p</i>�v�<i>q</i>\" but also\n\"~(<i>p</i>�v�~<i>q</i>)\", etc. etc.  We should then already have\nintroduced the effect of all possible combinations of brackets;\nand it would then have become clear that the proper general\nprimitive signs are not \"<i>p</i>�v�<i>q</i>\",\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>fx</i>\", etc., but the\nmost general form of their combinations."},{"href":"t547en.html","children":[{"href":"t5471en.html","children":[{"href":"t54711en.html","id":"54711","name":"5.4711","content":"To give the essence of proposition means to give\nthe essence of all description, therefore the essence of the\nworld."}],"id":"5471","name":"5.471","content":"The general form of proposition is the essence of\nproposition."},{"href":"t5472en.html","id":"5472","name":"5.472","content":"The description of the most general propositional\nform is the description of the one and only general primitive\nsign in logic."},{"href":"t5473en.html","children":[{"href":"t54731en.html","id":"54731","name":"5.4731","content":"Self-evidence, of which Russell has said so much,\ncan only be discard in logic by language itself preventing\nevery logical mistake.  That logic is a priori consists in the\nfact that we <i>cannot</i> think illogically."},{"href":"t54732en.html","children":[{"href":"t547321en.html","id":"547321","name":"5.47321","content":"Occam's razor is, of course, not an\narbitrary rule nor one justified by its practical success.  It\nsimply sais that <i>unnecessary</i> elements in a symbolism mean\nnothing.\nSigns which serve <i>one</i> purpose are logically\nequivalent, signs which serve <i>no</i> purpose are logically\nmeaningless."}],"id":"54732","name":"5.4732","content":"We cannot give a sign the wrong sense."},{"href":"t54733en.html","id":"54733","name":"5.4733","content":"Frege says: Every legitimately constructed\nproposition msut have a sense; and I say: Every possible\nproposition is legitimately constructed, and if it has no sense\nthis can only be because we have given no <i>meaning</i> to some\nof its constituent parts.\n(Even if we believe that we have done so.)\nThus \"Socrates is identical\" says\nnothing, because we have given <i>no</i> meaning to the word\n\"identical\" as <i>adjective</i>.  For when\nit occurs as the isng of equality it symbolizes in an entirely\ndifferent way -- the symbolizing relation is another --\ntherefore the symbol is in the two cases entirely different;\nthe two symbols have the sign in common with one another only\nby accident."}],"id":"5473","name":"5.473","content":"Logic must take care of itself.\nA <i>possible</i> sign must also be able to signify.\nEverything which is possible in logic is also permitted.\n(\"Socrates is identical\" means nothing because there is no\nproperty which is called \"identical\".  The proposition is\nsenseless beause we have not made some arbitrary determination,\nnot because the symbol is in itself unpermissible.)\nIn a certain sense we cannot make mistakes in logic."},{"href":"t5474en.html","id":"5474","name":"5.474","content":"The number of necessary fundamental operations\ndepends <i>only</i> on our notation."},{"href":"t5475en.html","id":"5475","name":"5.475","content":"It is only a question of constructing a system of\nsigns of a definite number of dimensions -- of a definite\nmathematical multiplicity."},{"href":"t5476en.html","id":"5476","name":"5.476","content":"It is clear that we are not concerned here with a\n<i>number of primitive ideas</i> which must be signified but with\nthe expression of a rule."}],"id":"547","name":"5.47","content":"It is clear that everything which can be said\n<i>beforehand</i> about the form of <i>all</i> propositions at all\ncan be said <i>on one occasion</i>.\nFor all logical operations are already contained in the\nelementary proposition.  For \"<i>fa</i>\"\nsays the same as \"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>fx�.�x=a</i>\".\nWhere there is composition, there is argument and\nfunction, and where these are, all logical constants already\nare.\nOne could say: the one logical constant is that which\n<i>all</i> propositions, according to their nature, have in common\nwith one another.\nThat however is the general form of proposition."}],"id":"54","name":"5.4","content":"Here it becomes clear that there are no such things\nas \"logical objects\" or \"logical constants\" (in the sense of\nFrege and Russell)."},{"href":"t55en.html","children":[{"href":"t5501en.html","children":[{"href":"t5511en.html","id":"5511","name":"5.511","content":"How can the all-embracing logic which mirrors the\nworld use such speial catches and manipulations?  Only because\nall these are connected into an infinitely fine network, to the\ngreat mirror."},{"href":"t5512en.html","id":"5512","name":"5.512","content":"\"~<i>p</i>\" is true if \"<i>p</i>\" is false.\nTherefore in the true proposition \"~<i>p</i>\" \"<i>p</i>\" is a\nfalse proposition.  How then can the stroke \"~\" bring it into\nagreement with reality?\nThat which denies in \"~<i>p</i>\" is\nhowever not \"~\", but that which all signs\nof this notation, which deny <i>p</i>, have in common.\nHence the common rule according to which \"~<i>p</i>\",\n\"~~~<i>p</i>\", \"~<i>p</i>�v�~<i>p</i>\",\n\"~<i>p</i>�.�~<i>p</i>\", etc. etc. (to infinity) are\nconstructed.  And this which is common to them all mirrors\ndenial."},{"href":"t5513en.html","id":"5513","name":"5.513","content":"We could say: What is common to all symbols, which\nassert both <i>p</i> and <i>q</i>, is the proposition\n\"<i>p</i>�.�<i>q</i>\".  What is common to all symbols,\nwhich asserts either <i>p</i> or <i>q</i>, is the proposition\n\"<i>p</i>�v�<i>q</i>\".\nAnd similarly we can say: Two p ropositions are opposed\nto one another when they have nothing in common with one\nanother; and every proposition has only one negative, because\nthere is only one proposition which lies altogether outside it.\nThus in Russell's notation also it appears\nevident that \"<i>q</i>�:�<i>p</i>�v�~<i>p</i>\"\nsays the same thing as \"<i>q</i>\"; that\n\"<i>p</i>�v�~<i>p</i>\" says nothing."},{"href":"t5514en.html","id":"5514","name":"5.514","content":"If a notation is fixed, there is in it a rule\naccording to which all the propositions denying <i>p</i> are\nconstructed, a rule according to which all the propositions\nasserting <i>p</i> are constructed, a rule according to which\nall the propositions asserting <i>p</i> or <i>q</i> are constructed,\nand so on.  These rules are equivalent to the symbols and in\nthem their sense is mirrored."},{"href":"t5515en.html","children":[{"href":"t55151en.html","id":"55151","name":"5.5151","content":"Must the sign of the negative proposition be\nconstructed by means of the sign of the positive?  Why should\none not be able to express the negative proposition by means of\na negative fact?  (Like: if \"<i>a</i>\" does not stand in a\ncertain relation to \"<i>b</i>\", it could express that\n<i>aRb</i> is not the case.)\nBut here also the negative proposition is indirectly\nconstructed with the positive.\nThe positive <i>proposition</i> must presuppose the\nexistence of the negative <i>proposition</i> and conversely."}],"id":"5515","name":"5.515","content":"It must be recognized in our symbols that what is\nconnected by \"v\", \".\", etc., must be propositions.\nAnd this is the case, for the symbols \"<i>p</i>\" and\n\"<i>q</i>\" presuppose \"v\", \"~\", etc.  If the sign \"<i>p</i>\"\nin \"<i>p</i>�v�<i>q</i>\" does not stand for a complex sign,\nthen by itself it cannot have sense; but then also the signs\n\"<i>p</i>�v�<i>p</i>\", \"<i>p</i>.  <i>p</i>\", etc. which\nhave the same sense as \"<i>p</i>\" have no sense.  If, however,\n\"<i>p</i>�v�<i>p</i>\" has no sense, then also\n\"<i>p</i>�v�<i>q</i>\" can have no sense."}],"id":"5501","name":"5.501","content":"An expression in brackets whose terms are\npropositions I indicate -- if the order of the terms in the\nbracket is indifferent -- by a sign of the form\n\"(<i><img src=\"lcxibar.gif\" alt=\"�xi-bar�\"></i>)\".  \"<i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>\" is a variable whose values\nare the terms of the expression in brackets, and the line over\nthe veriable indicates that it stands for all its values in the\nbracket.\n(Thus if <i><img src=\"lcxi.gif\" alt=\"�xi�\"></i> has the 3 values P, Q, R, then\n(<i><img src=\"lcxibar.gif\" alt=\"�xi-bar�\"></i>)�=�(P,�Q,�R).)\nThe values of the variables must be determined.\nThe determination is the description of the\npropositions which the variable stands for.\nHow the description of the terms of the expression in\nbrackets takes place is unessential.\nWe may distinguish 3 kinds of description: 1. Direct\nenumeration.  In this case we can place simply its constant\nvalues instead of the variable.  2. Giving a function <i>fx</i>,\nwhose values for all values of <i>x</i> are the propositions to be\ndescribed.  3. Giving a formal law, according to which those\npropositions are constructed.  In this case the terms of the\nexpression in brackets are all the terms of a formal series."},{"href":"t5502en.html","children":[{"href":"t5521en.html","id":"5521","name":"5.521","content":"I separate the concept <i>all</i> from the\ntruth-function.\nFrege and Russell have introduced generality in\nconnexion with the logical product of the logical sum.  Then it\nwould be difficult to understand the propositions\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>fx</i>\" and \"(<i>x</i>)�.�<i>fx</i>\" in\nwhich both ideas lie concealed."},{"href":"t5522en.html","id":"5522","name":"5.522","content":"That which is peculiar to the \"symbolism of\ngenerality\" is firstly, that it refers to a logical prototype,\nand secondly, that it makes constants prominent."},{"href":"t5523en.html","id":"5523","name":"5.523","content":"The generality symbol occurs as an argument."},{"href":"t5524en.html","id":"5524","name":"5.524","content":"If the objects are given, therewith are <i>all</i>\nobjects also given.\nIf the elementary propositions are given, then\ntherewith <i>all</i> elementary propositions are also given."},{"href":"t5525en.html","id":"5525","name":"5.525","content":"It is not correct to render the proposition\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>fx</i>\" -- as Russell does -- in the\nwords \"<i>fx</i> is <i>possible</i>\".\nCertainty, possibility or impossibility of a state of\naffairs are not expressed by a proposition but by the fact that\nan expression is a tautology, a significant proposition or a\ncontradiction.\nThat precedent to which one would always appeal, must\nbe present in the symbol itself."},{"href":"t5526en.html","children":[{"href":"t55261en.html","id":"55261","name":"5.5261","content":"A completely generalized proposition is like\nevery other proposition composite.  (This is shown by the fact\nthat in \"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>,�<img src=\"lcphi.gif\" alt=\"�phi�\">)�.�<img src=\"lcphi.gif\" alt=\"�phi�\"><i>x</i>\" we must\nmention \"<img src=\"lcphi.gif\" alt=\"�phi�\">\" and \"<i>x</i>\" separately.  Both stand\nindependently in signifying relations to the worled as in the\nungeneralized proposition.)\nA characteristic of a compositie symbol: it has\nsomething in common with <i>other</i> symbols."},{"href":"t55262en.html","id":"55262","name":"5.5262","content":"The truth or falsehood of <i>every</i> proposition\nalters something in the general structure of the world.  And\nthe range which is allowed to its structure by the totality of\nelementary propositions is exactly that which the completely\ngeneral propositions delimit.\n(If an elementary proposition is true, then, at any\nrate, there is one <i>more</i> elementary proposition true.)"}],"id":"5526","name":"5.526","content":"One can describe the world completely by\ncompletely generalized propositions, <i>i.e.</i> without from the\noutset co-ordinating any name with a definite object.\nIn order then to arrive at the customary way of\nexpression we need simply say after an expression \"there is\nonly and only one <i>x</i>, which .�.�.�.\": and this <i>x</i> is\n<i>a</i>."}],"id":"5502","name":"5.502","content":"Therefore I write instead of \"(- - - - -\nT)(<i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>, .�.�.�.)\", \"N(<i><img src=\"lcxibar.gif\" alt=\"�xi-bar�\"></i>)\".\nN(<i><img src=\"lcxibar.gif\" alt=\"�xi-bar�\"></i>) is the negation of all the values of\nthe propositional variable <i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>."},{"href":"t5503en.html","children":[{"href":"t55301en.html","id":"55301","name":"5.5301","content":"That identity is not a relation between objects\nis obvious.  This becomes very clear if, for example, one\nconsiders the proposition\n\"(<i>x</i>)�:�<i>fx</i>�.�<img src=\"hook.gif\" alt=\"�HOOK�\">�.�<i>x=a</i>\".  What this\nproposition says is simply that <i>only</i> <i>a</i> satisfies\nthe function <i>f</i>, and not that only such things satisfy the\nfunction <i>f</i> which have a certain relation to <i>a</i>.\nOne could of course say that in fact <i>only a</i> has\nthis relation to <i>a</i>, but in order to express this we should\nneed the sign of identity itself."},{"href":"t55302en.html","children":[{"href":"t55321en.html","id":"55321","name":"5.5321","content":"Instead of \"(<i>x</i>)�:�<i>fx</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>x=a</i>\" we therefore write\n<i>e.g.</i> \"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>fx</i>�.<img src=\"hook.gif\" alt=\"�HOOK�\">.�<i>fa</i>�:�~(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x,�y</i>)�.�<i>fx�.�fy</i>\".\nAnd if the proposition \"<i>only</i> one <i>x</i>\nsatisfies <i>f</i>(�)\" reads:\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>fx</i>�:�~(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x,�y</i>)�.�<i>fx�.�fy</i>\"."}],"id":"55302","name":"5.5302","content":"Russell's definition of \"=\" won't do; because\naccording to it one cannot say that two objects have all their\nproperties in common.  (Even if this proposition is never true,\nit is nevertheless <i>significant</i>.)"},{"href":"t55303en.html","id":"55303","name":"5.5303","content":"Roughly speaking: to say of <i>two</i> things that\nthey are identical is nonsense, and to say of <i>one</i> thing\nthat it is identical with itself is to say nothing."},{"href":"t5534en.html","id":"5534","name":"5.534","content":"And we see that the apparent propositions like:\n\"<i>a=a</i>\",\n\"<i>a=b�.�b=c�.<img src=\"hook.gif\" alt=\"�HOOK�\">�a=c</i>\",\n\"(<i>x</i>)�.�<i>x=x</i>\".\n\"(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>x=a</i>\",\netc. cannot be written in\na correct logical notation at all."},{"href":"t5535en.html","children":[{"href":"t55351en.html","id":"55351","name":"5.5351","content":"There are certain cases in which one is tempted\nto use expressions of the form \"<i>a=a</i>\" or\n\"<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>p</i>\" As, for instance, when one would\nspeak of the archtype Proposition, Thing, etc.  So Russell in\nthe <i>Princples of Mathematics</i> has rendered the nonsense\n\"<i>p</i> is a proposition\" in symbols by\n\"<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>p</i>\" and has put it as hypothesis before\ncertain propositions to show that their places for arguments\ncould only be occurpied by propositions.\n(It is nonsense to place the hypothesis\n<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>p</i> before a proposition in order to ensure that\nits arguments have the right form, because the hypotheses for a\nnon-proposition as arugment becomes not false but meaningless,\nand because the proposition itself becomes senseless for\narguments of the wrong kind, and therefore it survives the\nwrong arguments no better and no worse than the senseless\nhypthesis attached for this purpose.)"},{"href":"t55352en.html","id":"55352","name":"5.5352","content":"Similarly it was proposed to express \"There are\nno things\" by \"~(<img src=\"exists.gif\" alt=\"�EXISTS�\"><i>x</i>)�.�<i>x=x</i>\".  But even if\nthis were a proposition -- would it not be true if indeed\n\"There were things\", but these were not identical with\nthemselves?"}],"id":"5535","name":"5.535","content":"So all problems disappear which are connected with\nsuch pseudo-propositions.\nThis is the place to solve all the problems with arise\nthrough Russell's \"Axiom of Infinity\".\nWhat the axiom of infinity is meant to say would be\nexpressed in language by the fact that there is an infinite\nnumber of names with different meanings."}],"id":"5503","name":"5.503","content":"As it is obviously easy to express how\npropositions can be constructioned by means of this operation\nand how propositions are not to be constructed by means of it,\nthis must be capable of exact expression."},{"href":"t554en.html","children":[{"href":"t5541en.html","id":"5541","name":"5.541","content":"At first sight it appears as if there were also a\ndifferent way in which one proposition could occur in another.\nEspecially in certain propositional forms of\npsychology, like \"A thinks, that <i>p</i> is the case\", or \"A\nthinks <i>p</i>\", etc.\nHere it appears superficially as if the proposition\n<i>p</i> stood to the object A in a kind of relation.\n(And in modern epistemology (Russell, Moore, etc.)\nthose propositions have been conceived in this way.)"},{"href":"t5542en.html","children":[{"href":"t55421en.html","id":"55421","name":"5.5421","content":"This shows that there is no such thing as the\nsoul -- the subject, etc. -- as it is conceived in superficial\npsychology.\nA composite soul would not be a soul any longer."},{"href":"t55422en.html","id":"55422","name":"5.5422","content":"The correct explanation of the form of the\nproposition \"A judges <i>p</i>\" must show\nthat it is impossible to judge a nonsense.  (Russell's\ntheory does not satisfy this condition.)"},{"href":"t55423en.html","id":"55423","name":"5.5423","content":"To perceive a complex means to perceive that\nits constituents are combined in such and such a way.\nThis perhaps explains that the figure\n<br><center>\n<img src=\"f55423.gif\" alt=\"wire-frame cube\">\n</center><br>\ncan be seen in two ways as a cube; and all similar phenomena.  For\nwe really see two different facts.\n(If I fix my eyes first on the corners <i>a</i> and only\nglance at <i>b</i>, <i>a</i> appears in front and <i>b</i> behind, and\nvice versa.)"}],"id":"5542","name":"5.542","content":"But it is clear that \"A believes that <i>p</i>\",\n\"A thinks <i>p</i>\", \"A says <i>p</i>\", are of the form\n\"`<i>p</i>' says <i>p</i>\": and here we have no co-ordination\nof a fact and an object, but a co-ordination of facts by means\nof a co-ordination of their objects."}],"id":"554","name":"5.54","content":"In the general propositional form, propositions\noccur in a proposition only as bases of the truth-operations."},{"href":"t555en.html","children":[{"href":"t5551en.html","id":"5551","name":"5.551","content":"Our fundamental principle is that every question\nwhich can be decided at all by logic can be decided off-hand.\n(And if we get into a situation where we need to answer\nsuch a problem by looking at the world, this shows that we are\non a fundamentally wrong track.)"},{"href":"t5552en.html","children":[{"href":"t55521en.html","id":"55521","name":"5.5521","content":"And if this were not the case, how could we apply\nlogic?  We could say: if there were a logic, even if there were\nno world, how then could there be a logic, since there is a\nworld?"}],"id":"5552","name":"5.552","content":"The \"experience\" which we\nneed to understand logic is not that such and such is the case,\nbut that something <i>is</i>; but that is <i>no</i> experience.\nLogic <i>precedes</i> every experience -- that something\nis <i>so</i>.\nIt is before the How, not before the What."},{"href":"t5553en.html","id":"5553","name":"5.553","content":"Russell said that there were simple relations\nbetween different numbers of things (individuals).  But between\nwhat numbers?  And how should this be decided -- by experience?\n(There is no pre-eminent number.)"},{"href":"t5554en.html","children":[{"href":"t55541en.html","id":"55541","name":"5.5541","content":"How could we decide a priori whether, for\nexample, I can get into a situation in which I need to\nsymbolize with a sign of a 27-termed relation?"},{"href":"t55542en.html","id":"55542","name":"5.5542","content":"May we then ask this at all?  Can we set out a\nsign form and not know whether anything can correspond to it?\nHas the question sense: what must there <i>be</i> in order\nthat anything can be the case?"}],"id":"5554","name":"5.554","content":"The enumeration of any special forms would be\nentirely arbitrary."},{"href":"t5555en.html","id":"5555","name":"5.555","content":"It is clear that we have a concept of the\nelementary proposition apart from its special logical form.\nWhere, however, we can build symbols according to a\nsystem, there this system is the logically important thing and\nnot the single symbols.\nAnd how would it be possible that I should have to deal\nwith forms in logic which I can invent: but I must have to deal\nwith that which makes it possible for me to invent them."},{"href":"t5556en.html","children":[{"href":"t55561en.html","id":"55561","name":"5.5561","content":"Empirical reality is limited by the totality of\nobjects.  The boundary appears again in the totality of\nelementary propositions.\nThe hierarchies are and must be independent of reality."},{"href":"t55562en.html","id":"55562","name":"5.5562","content":"If we know on purely logical grounds, that there\nmust be elementary propositions, then this must be known by\neveryone who understands propositions in their unanalysed form."},{"href":"t55563en.html","id":"55563","name":"5.5563","content":"All propositions of our colloquial language are\nactually, just as they are, logically completely in order.\nThat simple thing which we ought to give here is not a model of\nthe truth but the complete truth itself.\n(Our problems are not abstract but perhaps the most\nconcrete that there are.)"}],"id":"5556","name":"5.556","content":"There cannot be a hierarchy of the forms of the\nelementary propositions.  Only that which we ourselves\nconstruct can we foresee."},{"href":"t5557en.html","children":[{"href":"t55571en.html","id":"55571","name":"5.5571","content":"If I cannot give elementary propositions a priori\nthen it must lead to obvious nonsense to try to give them"}],"id":"5557","name":"5.557","content":"The <i>application</i> of logic decides what\nelementary propositions there are.\nWhat lies in its application logic cannot anticipate.\nIt is clear that logic may not conflict with its\napplication.\nBut logic must have contact with its application.\nTherefore logic and its application may not overlap one\nanother."}],"id":"555","name":"5.55","content":"We must now answer a priori the question as to all\npossible forms of the elementary propositions.\nThe elementary proposition consists of names.  Since we\ncannot give the number of names with different meanings, we\ncannot give the composition of the elementary proposition."}],"id":"55","name":"5.5","content":"Every truth-function is a result of the successive\napplication of the operation (-�-�-�-�-T) (<i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>, .�.�.�.)\nto elementary propositions.\nThis operation denies all the propositions in the\nright-hand bracket and I call it the negation of these\npropositions."},{"href":"t56en.html","children":[{"href":"t561en.html","id":"561","name":"5.61","content":"Logic fills the world: the limits of the world are\nalso its limits.\nWe cannot therefore say in logic: This and this there\nis in the world, that there is not.\nFor that would apparently presuppose that we exclude\ncertain possibilities, and this cannot be the case since\notherwise logic must get outside the limits of the world: that\nis, if it could consider these limits from the other side also.\nWhat we cannot think, that we cannot think: we cannot\ntherefore <i>say</i> what we cannot think."},{"href":"t562en.html","children":[{"href":"t5621en.html","id":"5621","name":"5.621","content":"The world and life are one."}],"id":"562","name":"5.62","content":"This remark provides a key to the question, to what\nextent solipsism is a truth.\nIn fact what solipsism <i>means</i>, is quite correct,\nonly it cannot be <i>said</i>, but it shows itself.\nThat the world is <i>my</i> world, shows itself in the\nfact that the limits of the language (<i>the</i> language which I\nunderstand) mean the limits of <i>my</i> world."},{"href":"t563en.html","children":[{"href":"t5631en.html","id":"5631","name":"5.631","content":"The thinking, presenting subject; there is no such\nthing.\nIf I wrote a book \"The world as I found\nit\", I should also have therein to report on my body\nand say which members obey my will and which do not, etc.  This\nthen would be a method of isolating the subject or rather of\nshowing that in an important sense there is no subject: that is\nto say, of it alone in this book mention could <i>not</i> be made."},{"href":"t5632en.html","id":"5632","name":"5.632","content":"The subject does not belong to the world but it is\na limit of the world"},{"href":"t5633en.html","children":[{"href":"t56331en.html","id":"56331","name":"5.6331","content":"For the field of sight has not a form like this:\n<br><center>\n<img src=\"f56331.gif\" alt=\"egg outline, small circle inside sharp end labelled `Eye'\">\n</center>"}],"id":"5633","name":"5.633","content":"<i>Where in</i> the world is a metaphysical subject\nto be noted?\nYou say that this case is altogether like that of the\neye and the field of sight.  But you do <i>not</i> really see the\neye.\nAnd from nothing <i>in the field of sight</i> can it be\nconcluded that it is seen from an eye."},{"href":"t5634en.html","id":"5634","name":"5.634","content":"This is connected with the fact that no part of\nour experience is also a priori.\nEverything we see could also be otherwise.\nEverything we describe at all could also be otherwise.\nThere is no order of things a priori."}],"id":"563","name":"5.63","content":"I am the world.  (The microcosm.)"},{"href":"t564en.html","children":[{"href":"t5641en.html","id":"5641","name":"5.641","content":"There is therefore really a sense in which the\nphilosophy we can talk of a non-psychological I.\nThe I occurs in philosophy through the fact that the\n\"world is my world\".\nThe philosophical I is not the man, not the human body\nor the human soul of which psychology treats, but the\nmetaphysical subject, the limit -- not a part of the world."}],"id":"564","name":"5.64","content":"Here we see that solipsism strictly carried out\ncoincides with pure realism.  The I in solipsism shrinks to an\nextensionless point and there remains the reality co-ordinated\nwith it."}],"id":"56","name":"5.6","content":"<i>The limits of my language</i> mean the limits of my\nworld."}],"id":"5","name":"5","content":"Propositions are truth-functions of elementary\npropositions.\n(An elementary proposition is a truth-function of\nitself.)"},{"href":"t6en.html","children":[{"href":"t6001en.html","children":[{"href":"t611en.html","children":[{"href":"t6111en.html","id":"6111","name":"6.111","content":"Theories which make a proposition of logic appear\nsubstantial are always false.  Once could <i>e.g.</i> believe\nthat the words \"true\" and \"false\" signify two properties among\nother properties, and then it woud appear as a remarkable fact\nthat every proposition possesses one of these properties.  This\nnow by no means appears self-evident, no more so than the\nproposition \"All roses are either yellow or red\" would seem\neven if it were true.  Indeed our proposition now gets quite\nthe character of a proposition of natural science and this is\na certain symptom of its being falsely understood."},{"href":"t6112en.html","id":"6112","name":"6.112","content":"The correct explanation of logical propositions must\ngivem them a peculiar position among all propositions."},{"href":"t6113en.html","id":"6113","name":"6.113","content":"It is the characteristic mark of logical propositions\nthat one can perceive in the symbol alone that they are true;\nand this fact contains in itself the whole philosophy of\nlogic.  And so also it is one of the most important facts that\nthe truth or falsehood of non-logical propositions can\n<i>not</i> be recognized from the propositions alone."}],"id":"611","name":"6.11","content":"The propositions of logic therefore say nothing.\n(They are the analytical propositions.)"},{"href":"t612en.html","children":[{"href":"t61201en.html","id":"61201","name":"6.1201","content":"That <i>e.g.</i> the propositions \"<i>p</i>\" and\n\"~<i>p</i>\" in the connexion \"~<i>p</i>�.�~<i>p</i>\" give a\ntautology shows that they contradict one another.  That the\npropositions \"<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>\", \"<i>p</i>\" and\n\"<i>q</i>\" connected together in the form\n\"(<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>)�.�(<i>p</i>)�:<img src=\"hook.gif\" alt=\"�HOOK�\">:�(<i>q</i>)\" give a\ntautology shows that <i>q</i> follows from <i>p</i> and\n<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>.\nThat \"(<i>x</i>)�.�<i>fx</i>�:<img src=\"hook.gif\" alt=\"�HOOK�\">:�<i>fa</i>\" is a tautology shows that <i>fa</i>\nfollows from (<i>x</i>)�.�<i>fx</i>, etc. etc."},{"href":"t61202en.html","children":[{"href":"t61221en.html","id":"61221","name":"6.1221","content":"If for example two propositions \"<i>p</i>\" and \"<i>q</i>\" give\na tautology in the connexion \"<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>\", then it is clear\nthat <i>q</i> follows from <i>p</i>.\n<i>E.g.</i> that \"<i>q</i>\" follows from\n\"<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>�.�<i>p</i>\" we see from these two\npropositions themselves, but we can also show it by combining\nthem to \"<i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>�.�<i>p</i>�:<img src=\"hook.gif\" alt=\"�HOOK�\">:�<i>q</i>\" and\nthen showing that this is a tautology."},{"href":"t61222en.html","id":"61222","name":"6.1222","content":"This throws light on the question why logical\npropositions can no more be empirically confirmed than they can\nbe empirically refuted.  not only must a proposition of logic\nbe incapable of being contradicted by any possible experience,\nbut it must also be incapable of being confirmed by any such."},{"href":"t61223en.html","id":"61223","name":"6.1223","content":"It now becomes clear why we often feel as though\n\"logical truths\" must be \"<i>postulated</i>\" by us.  We can in fact\nposulate them in so far as we can postulate an adequate\nnotation."},{"href":"t61224en.html","id":"61224","name":"6.1224","content":"It also becomes clear why logic has been called the\ntheory of forms and of inference."}],"id":"61202","name":"6.1202","content":"It is clear that we could have used for this purpose\ncontradictions instead of tautologies."},{"href":"t61203en.html","children":[{"href":"t61231en.html","id":"61231","name":"6.1231","content":"The mark of logical propositions is not their general\nvalidity.\nTo be general is only to be accidentally valid for all\nthings.  An ungeneralized proposition can be tautologous just\nas well as a generalized one."},{"href":"t61232en.html","id":"61232","name":"6.1232","content":"Logical general validity, we could call essential as\nopposed to accidental general validity, <i>e.g.</i> of the\nproposition \"all men are mortal\".  Propositions like Russell's\n\"axiom of reducibility\" are not logical propositions, and this\nexplains our feeling that, if true, they can only be true by a\nhappy chance."},{"href":"t61233en.html","id":"61233","name":"6.1233","content":"We can imagine a world in which the axiom of\nreducibility is not valid.  But it is clear that logic has\nnothing to do with the question whether our world is really of\nthis kind or not."}],"id":"61203","name":"6.1203","content":"In order to recognize a tautology as such, we\ncan, in cases in which no sign of generality occurs in the\ntautology, make use of the following intuitive method: I write\ninstead of \"<i>p</i>\", \"<i>q</i>\", \"<i>r</i>, etc.,\n\"<i>TpF</i>\", \"<i>TqF</i>\", \"<i>TrF</i>\", etc.  The\ntruth-combinations I express by brackets, <i>e.g.</i>:\n<br><center>\n<img src=\"f61203a.gif\" alt=\"diagram of p/q=F/F F/T T/F T/T\">\n</center><br>\nand the co-ordination of the\ntruth or falsity of the whole proposition with the\ntruth-combinations of the truth-arguments by lines in the\nfollowing way: <br><center>\n<img src=\"f61203b.gif\" alt=\"diagram of p/q=(F/F F/T T/T)->T (T/F)->F\">\n</center>\nThis sign, for example, would therefore present the\nproposition <i>p</i>�<img src=\"hook.gif\" alt=\"�HOOK�\">�<i>q</i>.  Now I will proceed to inquire\nwhether such a proposition as ~(<i>p</i>�.�~<i>p</i>) (The Law of\nContradiction) is a tautology.  The form \"~<i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>\" is written\nin our notation\n<br><center><img src=\"f61203c.gif\" alt=\"diagram of xi=(F)->T, (T)->F\">\n</center><br>\nthe form \"<i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>�.�<i><img src=\"lceta.gif\" alt=\"�eta�\"></i>\" thus�:--\n<br><center>\n<img src=\"f61203d.gif\" alt=\"diagram of xi/eta=(F/F F/T T/F)->F (T/T)->T\">\n</center>\nHence the proposition ~(<i>p</i>�.�~<i>q</i>) runs\nthus�:--\n<br><center>\n<img src=\"f61203e.gif\" alt=\"diagram of p/q =(F/F F/T T/T)->T, T/F->F\">\n</center>\nIf here we put \"<i>p</i>\" instead of \"<i>q</i>\" and examine the\ncombination of the outermost T and F with the innermost, it is\nseen that the truth of the whole proposition is co-ordinated\nwith <i>all</i> the truth-combinations of its argument, its falsity\nwith none of the truth-combinations."},{"href":"t6124en.html","id":"6124","name":"6.124","content":"The logical propositions describe the scaffolding of\nthe world, or rather they present it.  They \"treat\" of\nnothing.  They presuppose that names have meaning, and that\nelementary propositions have sense.  And this is their\nconnexion with the world.  It is clear that it must show\nsomething about the world that certain combinations of symbols\n-- which essentially have a definite character -- are\ntautologies.  Herein lies the decisive point.  We said that in\nthe symbols which we use something is arbitrary, something\nnot.  In logic only this expresses: but this means that in\nlogic it is not <i>we</i> who express, by means of signs, what we\nwant, but in logic the nature of the essentially necessary\nsigns itself asserts.  That is to say, if we know the logical\nsyntax of any sign language, then all the propositions of logic\nare already given."},{"href":"t6125en.html","children":[{"href":"t61251en.html","id":"61251","name":"6.1251","content":"Hence there can <i>never</i> be surprises in logic."}],"id":"6125","name":"6.125","content":"It is possible, also with the old conception of logic,\nto give at the outset a description of all \"true\" logical\npropositions."},{"href":"t6126en.html","children":[{"href":"t61261en.html","id":"61261","name":"6.1261","content":"In logic process and result are equivalent.\n(Therefore no surprises.)"},{"href":"t61262en.html","id":"61262","name":"6.1262","content":"Proof in logic is only a mechanical expedient to\nfacilitate the recognition of tautology, where it is\ncomplicated."},{"href":"t61263en.html","id":"61263","name":"6.1263","content":"It would be too remarkable, if one could prove a\nsignificant proposition <i>logically</i> from another, and a logical\nproposition <i>also</i>.  It is clear from the beginning that the\nlogical proof of a significant proposition and the proof <i>in</i>\nlogic must be two quite different things."},{"href":"t61264en.html","id":"61264","name":"6.1264","content":"The significant proposition asserts something, and its\nproof shows that it is so; in logic every proposition is the\nform of a proof.\nEvery proposition of logic is a modus ponens present in\nsigns.  (And the modus ponens can not be expressed by a\nproposition.)"},{"href":"t61265en.html","id":"61265","name":"6.1265","content":"Logic can always be conceived to be such that every\nproposition is its own proof."}],"id":"6126","name":"6.126","content":"Whether a proposition belongs to logic can be\ncalculated by calculating the logical properties of the\n<i>symbol</i>.\nAnd this we do when we prove a logical proposition.  For\nwithout troubling ourselves about a sense and a meaning, we\nform the logical propositions out of others by mere <i>symbolic\nrules</i>.\nWe prove a logical proposition by creating it out of other\nlogical propositions by applying in succession certain\noperations, which again generate tautologies out of the first.\n(And from a tautology only tautologies <i>follow</i>.)\nNaturally this way of showing that its propositions are\ntautologies is quite unessential to logic.  Because the\npropositions, from which the proof starts, must show without\nproof that they are tautologies."},{"href":"t6127en.html","children":[{"href":"t61271en.html","id":"61271","name":"6.1271","content":"It is clear that the number of \"primitive propositions\nof logic\" is arbitrary, for we could deduce logic from one\nprimitive proposition by simply forming, for example, the\nlogical produce of Frege's primitive propositions.  (Frege\nwould perhaps say that this would no longer be immediately\nself-evident.  But it is remarkable that so exact a thinker as\nFrege should have appealed to the degree of self-evidence as\nthe criterion of a logical proposition.)"}],"id":"6127","name":"6.127","content":"All propositions of logic are of equal rank; there are\nnot some which are essentially primitive and others deduced\nfrom there.\nEvery tautology itself shows that it is a tautology."}],"id":"612","name":"6.12","content":"The fact that the propositions of logic are\ntautologies <i>shows</i> the formal -- logical -- properties of\nlanguage, of the world.\nThat its constituent parts connected together <i>in this\nway</i> give a tautology characterizes the logic of its\nconstituent parts.\nIn order that propositions connected together in a definite\nway may give a tautology they must have definite properties of\nstructure.  That they give a tautology when <i>so</i> connected\nshows therefore that they possess these properties of structure."},{"href":"t613en.html","id":"613","name":"6.13","content":"Logic is not a theory but a reflexion of the world.\nLogic is transcendental."}],"id":"6001","name":"6.001","content":"This says nothing else than that every proposition\nis the result of successive applications of the the operation\n<i>N</i>'(<i><img src=\"lcxibar.gif\" alt=\"�xi-bar�\"></i>) to the elementary propositions."},{"href":"t6002en.html","children":[{"href":"t6021en.html","children":[{"href":"t6211en.html","id":"6211","name":"6.211","content":"In life it is never a mathematical proposition which\nwe need, but we use mathematical propositions <i>only</i> in order\nto infer from propositions which do not belong to mathematics\nto others which equally do not belong to mathematics.\nIn philosophy the question is \"Why do we really use that\nword, that proposition?\" constantly leads to valuable results.)"}],"id":"6021","name":"6.021","content":"A number is the exponent of an operation."},{"href":"t6022en.html","id":"6022","name":"6.022","content":"The concept number is nothing else than that which is\ncommon to all numbers, the general form of a number."},{"href":"t623en.html","children":[{"href":"t6231en.html","id":"6231","name":"6.231","content":"It is a property of affirmation that it can be\nconceived as double denial.\nIt is a property of \"1+1+1=1\" that it can be conceived as\n\"(1+1)+(1+1)\"."},{"href":"t6232en.html","children":[{"href":"t62321en.html","id":"62321","name":"6.2321","content":"And, that the propositions of mathematics can be\nproved means nothing else than that their correctness can be\nseen without our having to compare what they express with the\nfacts as regards correctness."},{"href":"t62322en.html","id":"62322","name":"6.2322","content":"The identity of the meaning of two expressions cannot\nbe <i>asserted</i>.  For in order to be able to assert anything\nabout their meaning, I must know their meaning, and if I know\ntheir meaning, I know whether they mean the same or something\ndifferent."},{"href":"t62323en.html","id":"62323","name":"6.2323","content":"The equation characterizes only the standpoint from\nwhich I consider the two expressions, that is to say from the\nstandpoint of their equality of meaning."}],"id":"6232","name":"6.232","content":"Frege says that these expressions have the same\nmeaning but different senses.\nBut what is essential about equation is that it is not\nnecessary in order to show that both expressions, which are\nconnected by the sign of equality, have the same meaning: for\nthis can be perceived from the two expressions themselves."},{"href":"t6233en.html","children":[{"href":"t62331en.html","id":"62331","name":"6.2331","content":"The process of <i>calculation</i> brings about just this\nintuition.\nCalculation is not an experiement."}],"id":"6233","name":"6.233","content":"To the question whether we need intuition for the\nsolution of mathematical problems it must be answered that\nlanguage itself here supplies the necessary intuition."},{"href":"t6234en.html","children":[{"href":"t62341en.html","id":"62341","name":"6.2341","content":"The essential of mathematical method is working with\nequations.  On this method depends the fact that every\nproposition of mathematics must be self-evident."}],"id":"6234","name":"6.234","content":"Mathematics is a method of logic."}],"id":"623","name":"6.23","content":"If two expressions are connected by the sign of\nequality, this means that they can be substituted for one\nanother.  But whether this is the case must show itself in the\ntwo expressions themselves.\nIt characterizes the logical form of two expressions, that\nthey can be substituted for one another."},{"href":"t624en.html","children":[{"href":"t6241en.html","id":"6241","name":"6.241","content":"Thus the proof of the proposition 2�2=4 runs:\n<br>\n(<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup><i>v</i></sup>)<sup><i>�</i></sup>'<i>x</i>=<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup><i>v</i>�<i>�</i></sup>'<i>x</i> Def.\n<br>\n<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>2�2</sup>'<i>x</i>�=\n(<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>2</sup>)<sup>2</sup>'<i>x</i>�=\n(<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>2</sup>)<sup>1+1</sup>'<i>x</i>�=\n<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>2</sup>'<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>2</sup>'<i>x</i>�=\n<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>1+1</sup>'<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>1+1</sup>'<i>x</i>\n<br>\n=�(<img src=\"ucomega.gif\" alt=\"�OMEGA�\">'<img src=\"ucomega.gif\" alt=\"�OMEGA�\">)'(<img src=\"ucomega.gif\" alt=\"�OMEGA�\">'<img src=\"ucomega.gif\" alt=\"�OMEGA�\">)'<i>x</i>�=\n<img src=\"ucomega.gif\" alt=\"�OMEGA�\">'<img src=\"ucomega.gif\" alt=\"�OMEGA�\">'<img src=\"ucomega.gif\" alt=\"�OMEGA�\">'<img src=\"ucomega.gif\" alt=\"�OMEGA�\">'<i>x</i>�=\n<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>1+1+1+1</sup>'<i>x</i>�=\n<img src=\"ucomega.gif\" alt=\"�OMEGA�\"><sup>4</sup>'<i>x</i>."}],"id":"624","name":"6.24","content":"The method by which mathematics arrives at its\nequations is the method of substitution.\nFor equations express the substitutability of two\nexpressions, and we proceed from a number of equations to new\nequations, replacing expressions by others in accordance with\nthe equations."}],"id":"6002","name":"6.002","content":"If we are given the general form of the way in\nwhich a proposition is constructed, then thereby we are also\ngiven the general form of the way in which by an operation out\nof one proposition another can be created."},{"href":"t603en.html","children":[{"href":"t6031en.html","id":"6031","name":"6.031","content":"The theory of classes is altogether superfluous in\nmathematics.\nThis is connected with the fact that the generality which\nwe need in mathematics is not the <i>accidental</i> one."},{"href":"t632en.html","children":[{"href":"t6321en.html","children":[{"href":"t63211en.html","id":"63211","name":"6.3211","content":"Men had indeed an idea that there must be <i>a</i> \"law of\nleast action\", before they knew exactly how it ran.  (Here, as\nalways, the a priori certain proves to be something purely\nlogical.)"}],"id":"6321","name":"6.321","content":"\"Law of Causality\" is a class name.  And as in\nmechanics there are, for instance, minimum-laws, such as that\nof least actions, so in physics there are causal laws, laws of\nthe causality form."}],"id":"632","name":"6.32","content":"The law of causality is not a law but the form of a\nlaw. <a href=\"f632.html\">*</a>"},{"href":"t633en.html","id":"633","name":"6.33","content":"We do not <i>believe</i> a priori in a law of conservation,\nbut we <i>know</i> a priori the possibility of a logical form."},{"href":"t634en.html","children":[{"href":"t6341en.html","id":"6341","name":"6.341","content":"Newtonian mechanics, for example, brings the\ndescription of the universe to a unified form.  Let us imagine\na white surface with irregular black spots.  We now say:\nWhatever kind of picture these make I can always get as near as\nI like to its description, if I cover the surface with a\nsufficiently fine square network and now say of every square\nthat it is white or black.  In this way I shall have rbought\nthe description of the surface to a unified form.  This form is\narbitrary, because I could have applied with equal success a\nnet with a triangular or hexagonal mesh.  It can happen that\nthe description would have been simpler with the aid of a\ntriangular mesh; that is to say we might have described the\nsurface more accurately with a triangular, and coarser, than\nwith the finer square mesh, or vice versa, and so on.  To the\ndifferent networks correspond different systems of describing\nthe world. Mechanics determine a form of description by saying:\nAll propositions in the description of the world must be\nobtained in a given way from a number of given propositions --\nthe mechanical axioms.  It thus provides the bricks for\nbuilding the edifice of science, and says: Whatever building\nthou wouldst erect, thou shalt construct it in some manner\nwith these bricks and these alone.\n(As with the system of numbers one must be able to write\ndown any arbitrary number, so with the system of mechanics one\nmust be able to write down any arbitrary physical proposition.)"},{"href":"t6342en.html","id":"6342","name":"6.342","content":"And now we see the relative position of logic and\nmechanics.  (We could construct the network out of figures of\ndifferent kinds, as out of triangles and hexagons together.)\nThat a picture like that instanced above can be described by a\nnetwork of a given form asserts <i>nothing</i> about the picture.\n(for this holds of every picture of this kind.)  But <i>this</i>\ndoes characterize the picture, the fact, namely, that it can be\n<i>completely</i> described by a definite net of <i>definite</i> fineness.\nSo too the fact that it can be described by Newtonian\nmechanics asserts nothing about the world; but <i>this</i> asserts\nsomething, namely, that it can be described in that particular\nway in which as a matter of fact it is described.  the fact,\ntoo, that it can be described more simply by one system of\nmechanics than by another says something about the world."},{"href":"t6343en.html","children":[{"href":"t63431en.html","id":"63431","name":"6.3431","content":"Through their whole logical apparatus the physical\nlaws still speak of the objects of the world."},{"href":"t63432en.html","id":"63432","name":"6.3432","content":"We must not forget that the description of the world\nby mechanics is always quite general.  There is, for example,\nnever any mention of <i>particular</i> material points in it, but\nalways only of <i>some points or other</i>."}],"id":"6343","name":"6.343","content":"Mechanics is an attempt to construct according to a\nsingle plan all <i>true</i> propositions which we need forthe\ndescription of the world."}],"id":"634","name":"6.34","content":"All propositions, such as the law of causation, the\nlaw of continuity in nature, the law of least expenditure in\nnature, etc. etc., all these are a priori intuitions of\npossible forms of the propositions of science,"},{"href":"t635en.html","id":"635","name":"6.35","content":"Although the spots in our picture are geometrical\nfigures, geometry can obviously say nothing about their actual\nform and position.  But the network is <i>purely</i> geometrical,\nand all its properties can be given a priori.\nLaws, like the law of causation, etc., treat of the network\nand not what the network describes."},{"href":"t636en.html","children":[{"href":"t6361en.html","children":[{"href":"t63611en.html","children":[{"href":"t636111en.html","id":"636111","name":"6.36111","content":"The Kantian problem of the right and left hand which\ncannot be made to cover one another already exists in the\nplane, and even in one-dimensional space; where the two\ncongruent figures <i>a</i> and <i>b</i> cannot be made to cover one\nanother without\n<br><center>\n<img src=\"f636111.gif\" alt=\". . . o----A----x . . . x----B----o . . . .\">\n</center><br>\nmoving them out of this space.  The right and left hand are in\nfact completely congruent.  And the fact that they cannot be\nmade to cover one another has nothing to do with it.\nA right-hand glove could be put on a left hand if it could\nbe turned round in four-dimensional space."}],"id":"63611","name":"6.3611","content":"We cannot compare any process with the \"passage of\ntime\" -- there is no such thing -- but only with another\nprocess (say, with the movement of the chonometer).\nHence the description of the temporal sequence of events is\nonly possible if we support ourselves on another process.\nIt is exactly analogous for space.  When, for example, we\nsay that neither of two events (which mutually exclude one\nanother) can occur, because there is <i>no cause</i> why the one\nshould occur rather than the other, it is really a matter of\nour being unable to descibe <i>one</i> of the two events unless\nthere is some sort of asymmetry.  And if there <i>is</i> such an\nasymmetry, we can regard this as the <i>cause</i> of the occurrence\nof the one and of the non-occurrence of the other."}],"id":"6361","name":"6.361","content":"In ther terminology of Hertz we might say: Only\n<i>uniform</i> connections are <i>thinkable</i>."},{"href":"t6362en.html","id":"6362","name":"6.362","content":"What can be described can happen too, and what is\nexcluded by the law of causality cannot be described."},{"href":"t6363en.html","children":[{"href":"t63631en.html","children":[{"href":"t636311en.html","id":"636311","name":"6.36311","content":"That the sun will rise to-morrow, is an hypothesis;\nand that means that we do not <i>know</i> whether it will rise."}],"id":"63631","name":"6.3631","content":"This process, however, has no logical foundation but\nonly a psychological one.\nIt is clear that there are no grounds for believing that the\nsimplest course of events will really happen."}],"id":"6363","name":"6.363","content":"The process of induction is the process of assuming\nthe <i>simplest</i> law that can be made to harmonize with our\nexperience."}],"id":"636","name":"6.36","content":"If there were a law of causality, it might run: \"There\nare natural laws\".\nBut that can clearly not be said: it shows itself."},{"href":"t637en.html","children":[{"href":"t6371en.html","id":"6371","name":"6.371","content":"At the basis of the whole modern view of the world\nlies the illusion that the so-called laws of nature are the\nexplanations of natural phenomena."},{"href":"t6372en.html","id":"6372","name":"6.372","content":"So people stop short at natural laws as something\nunassailable, as did the ancients at God and Fate.\nAnd they are both right and wrong.  but the ancients\nwere clearer, in so far as they recognized one clear terminus,\nwhereas the modern system makes it appear as though\n<i>everything</i> were explained."},{"href":"t6373en.html","id":"6373","name":"6.373","content":"The world is independent of my will."},{"href":"t6374en.html","id":"6374","name":"6.374","content":"Even if everything we wished were to happen, this\nwould only be, so to speak, a favour of fate, for there is no\n<i>logical</i> connexion between will and world, which would\nguarantee this, and the assumed physical connexion itself we\ncould not against will."},{"href":"t6375en.html","children":[{"href":"t63751en.html","id":"63751","name":"6.3751","content":"For two colours, <i>e.g.</i> to be at one place in the\nvisual field, is impossible, logical impossible, for it is\nexcluded by the logical structure of colour.\nLet us consider how this contradiction presents itself in\nphysics.  Somewhat as follows: That a particle cannot at the\nsame time have two velocities, <i>i.e.</i> that at the same time\nit cannot be in two places, <i>i.e.</i> that particles in different\nplaces at the same time cannot be identical.\nIt is clear that the logical product of two elementary\npropositions can neither be a tautology nor a contradiction.\nThe assertion that a point in the visual field has two\ndifferent colours at the same time, is a contradiction."}],"id":"6375","name":"6.375","content":"As there is only a <i>logical</i> necessity, so there is\nonly a <i>logical</i> impossibility."}],"id":"637","name":"6.37","content":"A necessity for one thing to happen because another\nhas happened does not exist.  There is only <i>logical</i> necessity."}],"id":"603","name":"6.03","content":"The general form of the cardinal number is:\n[0, <i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>, <i><img src=\"lcxi.gif\" alt=\"�xi�\"></i>+1]."},{"href":"t64en.html","children":[{"href":"t641en.html","id":"641","name":"6.41","content":"The sense of the world must lie outside the world.\nIn the world everything is as it is and happens as it does\nhappen.  <i>In</i> it there is no value -- and if there were, it\nwould be of no value.\nIf there is a value which is of value, it must lie outside\nall happening and being-so.  For all happening and being-so is\naccidental.\nWhat makes it non-accidental cannot lie <i>in</i> the world, for\notherwise this would again be accidental.\nIt must lie outside the world."},{"href":"t642en.html","children":[{"href":"t6421en.html","id":"6421","name":"6.421","content":"It is clear that ethics cannot be expressed.\nEthics is transcendental.\n(Ethics and �sthetics are one.)"},{"href":"t6422en.html","id":"6422","name":"6.422","content":"The first thought in setting up an ethical law of the\nform \"thou shalt�.�.�.\" is: And what if I do not do it?  But it\nis clear that ethics has nothing to do with punishment and\nreward in the ordinary sense.  This question as to the\n<i>consequences</i> of an action must therefore be irrelevant.  At\nleast thse consequences will not be events.  For there must be\nsomething right in that formulation of the qustion.  There\nmust be some sort of ethical reward and ethical punishment, but\nthis must lie in the action itself.\n(And this is clear also that the reward must be\nsomething acceptable, and the punishment something\nunacceptable.)"},{"href":"t6423en.html","id":"6423","name":"6.423","content":"Of the will as the subject of the ethical we cannot\nspeak.\nAnd the will as a phenomenon is only of interest to\npsychology."}],"id":"642","name":"6.42","content":"Hence also there can be no ethical propositions.\nPropositions cannot express anything higher."},{"href":"t643en.html","children":[{"href":"t6431en.html","children":[{"href":"t64311en.html","id":"64311","name":"6.4311","content":"Death is not an event of life.  Death is not lived\nthrough.\nIf by eternity is understood not endless temporal duration\nbut timelessness, then he lives eternally who lives in the\npresent.\nOur life is endless in the way that our visual field is\nwithout limit."},{"href":"t64312en.html","id":"64312","name":"6.4312","content":"The temporal immortality of the human soul, that is\nto say, its eternal survival after death, is not only in no way\nguaranteed, but this assumption in the first place will not do\nfor us what we always tried to make it do.  Is a riddle solved\nby the fact that I survive for ever?  Is this eternal life not\nas enigmatic as our present one?  The solution of the riddle of\nlife in space and time lies <i>outside</i> space and time.\n(It is not problems of natural science which have to be\nsolved.)"}],"id":"6431","name":"6.431","content":"As in death, too, the world does not change, but\nceases."},{"href":"t6432en.html","children":[{"href":"t64321en.html","id":"64321","name":"6.4321","content":"The facts all belong only to the task and not to its\nperformance."}],"id":"6432","name":"6.432","content":"<i>How</i> the world is, is completely indifferent for what\nis higher.  God does not reveal himself <i>in</i> the world."}],"id":"643","name":"6.43","content":"If good or bad willing changes the world, it can only\nchange the limits of the world, not the facts; not the things\nthat can be expressed in language.\nIn brief, the world must thereby become quite another, it\nmust so to speak wax or wane as a whole.\nThe world of the happy is quite another than that of the\nunhappy."},{"href":"t644en.html","id":"644","name":"6.44","content":"Not <i>how</i> the world is, is the mystical, but <i>that</i> it\nis."},{"href":"t645en.html","id":"645","name":"6.45","content":"The contemplation of the world sub specie aeterni is\nits contemplation as a limited whole.\nThe feeling that the world is a limited whole is the\nmystical feeling."}],"id":"64","name":"6.4","content":"All propositions are of equal value."},{"href":"t65en.html","children":[{"href":"t651en.html","id":"651","name":"6.51","content":"Scepticism is <i>not</i> irrefutable, but palpably\nsenseless, if it would doubt where a question cannot be asked.\nFor doubt can only exist where there is a question; a\nquestion only where there is an answer, and this only where\nsomething <i>can be said</i>."},{"href":"t652en.html","children":[{"href":"t6521en.html","id":"6521","name":"6.521","content":"The solution of the problem of life is seen in the\nvanishing of this problem.\n(Is not this the reason why men to whom after long doubting\nthe sense of life became clear, could not then say wherein this\nsense consisted?)"},{"href":"t6522en.html","id":"6522","name":"6.522","content":"There is indeed the inexpressible.  This <i>shows</i>\nitself; it is the mystical."}],"id":"652","name":"6.52","content":"We feel that even if <i>all possible</i> scientific\nquestions be asnwered, the problems of life have still not been\ntouched at all.  Of course there is then no question left, and\njust this is the answer."},{"href":"t653en.html","id":"653","name":"6.53","content":"The right method of philosophy would be this: To say\nnothing except what can be said, <i>i.e.</i> the propositions of\nnatural science, <i>i.e.</i> something that has nothing to do with\nphilosophy: and then always, when someone else wished to say\nsomething metaphysical, to demonstrate to him that he had given\nno meaning to certain signs in his propositions.  This method\nwould be unsatisfying to the other -- he would not have the\nfeeling that we were teaching him philosophy -- but it would be\nthe only strictly correct method."},{"href":"t654en.html","id":"654","name":"6.54","content":"My propositions are elucidatory in this way: he who\nunderstands me finally recognizes them as senseless, when he has\nclimbed out through them, on them, over them.  (He must so to\nspeak throw away the ladder, after he has climbed up on it.)\nHe must surmount these propositions; then he sees the world\nrightly."}],"id":"65","name":"6.5","content":"For an answer which cannot be expressed the question\ntoo cannot be expressed.\n<i>The riddle</i> does not exist.\nIf a question can be put at all, then it <i>can</i> also be\nanswered."}],"id":"6","name":"6","content":"The general form of truth-function is: [<img src=\"lcpbar.gif\" alt=\"�p-bar�\">,\n<i><img src=\"lcxibar.gif\" alt=\"�xi-bar�\"></i>, <i>N</i>(<i><img src=\"lcxibar.gif\" alt=\"�xi-bar�\"></i>)].\nThis is the general form of proposition."},{"href":"t7en.html","id":"7","name":"7","content":"Whereof one cannot speak, thereof one must be silent."}]}